;HL_MENU 菜单模块
[IDR_HLTYPE]
IDR_HLTYPE_SUBMENU_0=文件(F)
IDR_HLTYPE_SUBMENU_1=编辑(E)
IDR_HLTYPE_SUBMENU_2=绘图(D)
IDR_HLTYPE_SUBMENU_3=修改(A)
IDR_HLTYPE_SUBMENU_4=工具(T)
IDR_HLTYPE_SUBMENU_5=查看(V)
IDR_HLTYPE_SUBMENU_6=系统参数设置(S)
IDR_HLTYPE_SUBMENU_7=打标(M)
IDR_HLTYPE_SUBMENU_8=窗口(W)
IDR_HLTYPE_SUBMENU_9=帮助(H)
IDR_HLTYPE_SUBMENU_10=

[IDR_HLTYPE_SUBMENU_0]
57600=新建(&N)	Ctrl+N
57601=打开(&O)...	Ctrl+Of
57602=关闭(C)
57603=保存(&S)	Ctrl+S
57604=另存为(&A) 
0=----------------------
306    =导入(I)...
33156=导入数控加工文件
0=----------------------
57607=打印...	Ctrl+P
57606=打印设置(R)...
0=----------------------
57616=最近文件
0=----------------------
57665=退出(X)

[IDR_HLTYPE_SUBMENU_1]
57643=撤消(&U)	Ctrl+Z
57644=重做(&R)	Ctrl+Y
0=----------------------
57635=剪切(&T)	Ctrl+X
33419=复制(&C)	Ctrl+C
57637=粘贴(&P)	Ctrl+V
32791=删除(&D)	Del
57642=全选(&A)	Ctrl+A
0=----------------------
32828=组合(&G)	Ctrl+G
32829=取消组合(&U)	Ctrl+U
33131=对象群组
33132=取消群组
33040=对象合成(&U)	Shift+U
0=----------------------
33415=转为位图
33011=转为曲线
33413=转为摆动线
0=----------------------
33235=Excel转为TXT
33229=批量替换文本
0=----------------------
32832=选项(&O)...

[IDR_HLTYPE_SUBMENU_2]
32821=点取(&C)
0=----------------------
307    =手动绘图(&H)
33097=样条曲线
32813=矩形(&R)
32814=椭圆(&E)
33113=圆弧1(&A)
33115=圆弧2(&A)
33117=圆(&C)
32815=多边形(&P)
32816=网格(&G)
33129=点(&D)
33244=螺旋线
0=----------------------
308    =文本及跳号(&T)
32919=条码(&B)
0=----------------------
33092=延时(&D)
33093=输入信号(&I)
33094=输出信号(&O)
33138=运动控制(&M)
33139=电机位置(&S)
33141=条件判断(&C)
33189=激光控制对象
33198=CCD拍照对象
33200=位置校正对象
0=----------------------
32820=填充(&F)

[IDR_HLTYPE_SUBMENU_3]
32940=阵列排布(&A)...
0=----------------------
33399=对象变换
33409=造型
IDR_HLTYPE_SUBMENU_3_0=变换
IDR_HLTYPE_SUBMENU_3_1=排序
IDR_HLTYPE_SUBMENU_3_2=曲线编辑
33027=滤点(&F)	Ctrl+F
33426= 界面UI皮肤

[IDR_HLTYPE_SUBMENU_3_0]
32901=居中(&M)	Ctrl+M
0=----------------------
32913=左旋90度(&L)
32914=右旋90度(&R)
0=----------------------
32907=左右镜像(&X)
32908=上下镜像(&Y)
0=----------------------
33040=对象合成(&U)	Alt+U

[IDR_HLTYPE_SUBMENU_3_1]
33029=手动排序(&M)	Alt+M
33030=自动排序(&A)	Alt+A
33068=选择排序(&S)		Alt+S
33246=自动排序2
33245=按图层排序
33079=快速排序
33080=恢复正常排序

[IDR_HLTYPE_SUBMENU_3_2]
33182=去除交叉点
33076=相邻曲线合并
33241=删除重线
33205=线条加粗

[IDR_HLTYPE_SUBMENU_4]
33162=微焦定位
33220=文本分离
33136=数据重组
33184=铺助点定位
33142=创建刻度尺
33224=测量距离
33225=测量角度

[IDR_HLTYPE_SUBMENU_5]
59392=系统工具栏
132    =缩放工具栏(&S)
131    =绘图工具栏(&D)
33275=对象操作工具栏
33406=3D图形绘制工具栏
33407=其他图形绘制工具栏
33408=对齐工具栏
0=----------------------
59393=状态栏(&S)
33008=列表对话框
33009=属性对话框
0=----------------------
33074=IO检测(&T)...

[IDR_HLTYPE_SUBMENU_6]
32841=系统设置(&H)...
33425=语言切换
33053=快捷键设置(&K)
33085=编辑自定义字体(&F)
0=----------------------
33054=权限管理(&R)
33059=切换用户(&X)
33130=注销当前用户(&L)
0=----------------------
33001=灰度设置(&G)...
33002=灰度非线性补偿(&P)
33414=矢量转为位图设置
0=----------------------
33077=校正参数设置(&C)
33422=9点校正
33254=3D校正设置
33230=三维BOX补偿
33256=飞行参数设置
33165=运动参数设置
33236=串口输出设置
0=----------------------
33402=设置卡别名
33145=切换控制卡
0=----------------------
33262=测试激光

[IDR_HLTYPE_SUBMENU_7]
32779=通用打标(&N)...	F10
33137=旋转打标(&R)....
32951=多文档打标(&M)...	F8
33211=动态运动打标...
33251=多卡打标 
33258=飞行打标
0=----------------------
33062=红光预览
32783=打标预览(&P)...	F9
0=----------------------
33061=联机IO选文档(&S)
33086=脱机IO选文档(&O)
33072=选中数据脱机下载(&D)...
33073=擦除已下载脱机数据

[IDR_HLTYPE_SUBMENU_8]
57648=新建窗口(&N)
57650=层叠(&C)
57651=平铺(&T)
57649=排列图标(&A)

[IDR_HLTYPE_SUBMENU_9]
57664=关于 HBM/HE(&A)
33147=扩展功能信息
33168=本版特性
IDR_HLTYPE_SUBMENU_9_0=帮助(&H)
33218=查询EMCC卡运行信息
33238=配置参数导入
33239=配置参数导出

[IDR_HLTYPE_SUBMENU_9_0]
33193=中文
33194=英文

[IDR_EDITFRAME]
IDR_EDITFRAME_SUBMENU_0=文件(F)
IDR_EDITFRAME_SUBMENU_1=视图(&V)
IDR_EDITFRAME_SUBMENU_2=设置(&S)
IDR_EDITFRAME_SUBMENU_3=帮助(&H)

[IDR_EDITFRAME_SUBMENU_0]
57600=新建(&N)         Ctrl+N
57601=打开(&O) ...      Ctrl+O
32953=打开多文档(&M)...
0=----------------------
57606=打印设置(R)...
0=----------------------
57616=最近文件
0=----------------------
57665=退出(X)

[IDR_EDITFRAME_SUBMENU_1]
IDR_EDITFRAME_SUBMENU_1_0=工具栏(&T)
106=属性页(&P)
59393=状态栏(&S)

[IDR_EDITFRAME_SUBMENU_1_0]
59392=常用(&C)
131=绘图(&D)
130=变换(&g)
132=缩放(&S)

[IDR_EDITFRAME_SUBMENU_2]
32841=系统设置(&H)...

[IDR_EDITFRAME_SUBMENU_3]
57664=关于 HBM/HE(&A)

[IDR_MAINFRAME]
IDR_MAINFRAME_SUBMENU_0=文件(F)
IDR_MAINFRAME_SUBMENU_1=视图(&V)
IDR_MAINFRAME_SUBMENU_2=设置(&S)
IDR_MAINFRAME_SUBMENU_3=帮助(&H)

[IDR_MAINFRAME_SUBMENU_0]
57600=新建(&N)         Ctrl+N
57601=打开(&O) ...      Ctrl+O
32953=打开多文档(&M)...
0=----------------------
57606=打印设置(R)...
0=----------------------
57616=最近文件
0=----------------------
57665=退出(X)

[IDR_MAINFRAME_SUBMENU_1 ]
IDR_MAINFRAME_SUBMENU_1_0=工具栏(&T)
106=属性页(&P)
59393=状态栏(&S)
33008=列表对话框
33009=属性对话框

[IDR_MAINFRAME_SUBMENU_1_0]
59392=常用(&C)
131=绘图(&D)
130=变换(&g)
132=缩放(&S)

[IDR_MAINFRAME_SUBMENU_2]
32841=系统设置(&H)...

[IDR_MAINFRAME_SUBMENU_3]
57664=关于 HBM/HE(&A)
33218=查询EMCC卡运行信息

[IDR_HETYPE]
IDR_HETYPE_SUBMENU_0=文件(F)
IDR_HETYPE_SUBMENU_1=编辑(E)
IDR_HETYPE_SUBMENU_2=绘图(D)
IDR_HETYPE_SUBMENU_3=修改(A)
IDR_HETYPE_SUBMENU_4=工具(T)
IDR_HETYPE_SUBMENU_5=查看(V)
IDR_HETYPE_SUBMENU_6=系统参数设置(S)
IDR_HETYPE_SUBMENU_7=窗口(W)
IDR_HETYPE_SUBMENU_8=帮助(H)

[IDR_HETYPE_SUBMENU_0]
57600=新建(&N)	Ctrl+N
57601=打开(&O) ...	Ctrl+O
57602=关闭(C)
57603=保存(&S)	Ctrl+S
57604=另存为(&A) 
0=----------------------
306    =导入(I)...
33156=导入数控加工文件
0=----------------------
57607=打印...	Ctrl+P
57606=打印设置(R)...
0=----------------------
57616=最近文件
0=----------------------
57665=退出(X)

[IDR_HETYPE_SUBMENU_1]
57643=撤消(&U)	Ctrl+Z
57644=重做(&R)	Ctrl+Y
0=----------------------
57635=剪切(&T)	Ctrl+X
33419=复制(&C)	Ctrl+C
57637=粘贴(&P)	Ctrl+V
32791=删除(&D)	Del
57642=全选(&A)	Ctrl+A
0=----------------------
32828=组合(&G)	Ctrl+G
32829=取消组合(&U)	Ctrl+U
33131=对象群组
33132=取消群组
0=----------------------
33011=转为曲线
33413=转为摆动线
0=----------------------
33415=矢量转为位图
33235=Excel转为TXT
0=----------------------
33229=批量替换文本
0=----------------------
33402=设置卡别名
33145=切换控制卡
0=----------------------
32832=选项(&O)...

[IDR_HETYPE_SUBMENU_2]
32821=点取(&C)
0=----------------------
307    =手动绘图(&H)
33097=样条曲线
32813=矩形(&R)
32814=椭圆(&E)
33113=圆弧1(&A)
33115=圆弧2(&A)
33117=圆(&C)
32815=多边形(&P)
32816=网格(&G)
33129=点(&D)
33244=螺旋线
0=----------------------
308    =文本及跳号(&T)
32919=条码(&B)
0=----------------------
33092=延时(&D)
33093=输入信号(&I)
33094=输出信号(&O)
33138=运动控制(&M)
33139=电机位置(&S)
33141=条件判断(&C)
33189=激光控制对象
33198=CCD拍照对象
33200=位置校正对象
0=----------------------
32820=填充(&F)

[IDR_HETYPE_SUBMENU_3]
32940=阵列排布(&A)...
0=----------------------
33399=对象变换
33409=造型
IDR_HETYPE_SUBMENU_3_0=变换
IDR_HETYPE_SUBMENU_3_1=排序
IDR_HETYPE_SUBMENU_3_2=曲线编辑
33027=滤点(&F)	Ctrl+F

[IDR_HETYPE_SUBMENU_3_0]
32901=居中(&M)	Ctrl+M
32913=左旋90度(&L)
32914=右旋90度(&R)
32907=左右镜像(&X)
32908=上下镜像(&Y)
33040=对象合成(&U)	Alt+U

[IDR_HETYPE_SUBMENU_3_1]
33029=手动排序(&M)	Alt+M
33030=自动排序(&A)	Alt+A
33068=选择排序(&S)		Alt+S
33246=自动排序2
33245=按图层排序
33079=快速排序
33080=恢复正常排序

[IDR_HETYPE_SUBMENU_3_2]
33182=去除交叉点
33076=相邻曲线合并
33241=删除重线
33205=线条加粗

[IDR_HETYPE_SUBMENU_4]
33162=微焦定位
33220=无损圆周打标，文本切分
33136=数据重组
33184=铺助点定位
33142=创建刻度尺
33224=测量距离
33225=测量角度

[IDR_HETYPE_SUBMENU_5]
IDR_HETYPE_SUBMENU_5_0=工具栏(&T)
IDR_HETYPE_SUBMENU_5_1=缩放(&Z)
59393=状态栏(&S)
33008=列表对话框
33009=属性对话框

[IDR_HETYPE_SUBMENU_5_0]
 59392=常用(&C)
131=绘图(&D)
130=变换(&g)
132=缩放(&S)

[IDR_HETYPE_SUBMENU_5_1]
32804=缩小(&O)
32805=放大(&I)
32807=所有对象(&A)
32808=所选对象(&S)
32809=页面(&P)
32809=非比例缩放(&R)

[IDR_HETYPE_SUBMENU_6]
33425=语言切换
33053=按键绑定设置(&K)
33085=编辑自定义字体(&F)
0=----------------------
33001=灰度设置(&G)...
33002=灰度非线性补偿(&P)
33414=矢量转为位图设置
0=----------------------
33054=权限管理(&R)
33059=切换用户(&X)
33130=注销当前用户(&L)

[IDR_HETYPE_SUBMENU_6_0]
33175=English
33176=简体中文
33177=繁体中文
33418=语言选择

[IDR_HETYPE_SUBMENU_7]
57648=新建窗口(&N)
57650=层叠(&C)
57651=平铺(&T)
57649=排列图标(&A)

[IDR_HETYPE_SUBMENU_8]
57664=关于 HBM/HE(&A)
33168=本版特性
IDR_HETYPE_SUBMENU_8_0=帮助(&H)

[IDR_HETYPE_SUBMENU_8_0]
33193=中文
33194=英文

;DIALOG 对话框模块
[ID_CHANG_DLG]
CAPTION=
2149=位置
2150=尺寸(mm):
1405=缩扩
1730=绝对位置:
2151=旋转角度:
2152=旋转轴:
2153=缩放(%) :
1404=应用于再制
1=应用
1492=
2500=
1494=
1502=
1503=
1506=
1504=
1505=
1507=
1508=
1535=
1398=Button
2146=
1678=
1729=
1511=

[ID_CHANG_DLG_OTHER]
CAPTION=Dialog
2155=切变角度：
1403=居中
1685=缩扩
1=确定 
2=取消

[IDD_ABOUTBOX]
CAPTION=关于 HBM
2158=软件版本信息
1475=序列号：
1843=加密锁信息:
2159=集成商ID
2160=设备ID 

[IDD_ARRAY]
CAPTION=阵列排布
1263=标准
1645=纵向优先
1646=横向优先
1647=行方式
1648=S方式
1649=偏移间距
1650=边界间距
2161=行数
2162=列数
2163=行间距(mm)
2164=列间距(mm)
1239=自定义
1265=刷新自屏幕
1256=增加...
1266=编辑...
1186=删除
1780=模版
1778=导入模版
1779=导出模版
2165=对象旋转(单位:度)
1772=旋转
2166=偏移
2167=左X
2168=右X
2169=左Y
2170=右Y
1785=设置
1410=跳号自动递增
1258=保存样式...
1298=装入样式...
2171=打标测试
1634=红光
1492=激光
1013=开始
1019=应用
1=确定
2=取消
1218=
1012=
1242=
1006=
1303=
2160=
1769=
1781=
1782=
1783=
1784=
1502=
114=MINI

[IDD_ARRAYPOS]
CAPTION=座标设置
1070=
1071=
1=确定
2=取消
2065=X座标(mm)
2066=Y座标(mm)
1072=
2151=R旋转(度)

[IDD_BAR_PAGE]
CAPTION=
1499=反相
1502=
1637=
1013=
1282=
1162=
1029=
1717=优化
1339=连接
1722=
1723=
1848=点阵化
1849=
1718=自动填充
1951=校验位
1724=
1500=中间镂空
1503=
1850=
1973=IDD_BAR_PAGE_COMBOBOX_0
1912=使用默认语言
1974=语言选择使能
1535=缩扩填充
1283=
1284=
1952=合并
1501=QR定位点镂空
1504=
1852=
2095=IDD_BAR_PAGE_COMBOBOX_1
2096=
2097=圆模式
1493=矩形模式
2098=点模式
2157=宽度(mm)
680=宽窄比(％)
2155=缩进(mm)
2154=高度(mm)
1750=线间距(mm)
2104=角度
1413=单线打标次数：
2159=窄条线条数：
2158=高度(mm)
2160=半径(mm)
2164=宽度(mm)
2166=高度(mm)
2168=语言：
2161=采样精度
2162=采样点数
2165=宽度(mm)
2167=高度(mm)
2163=打标顺序：

[IDD_BAR_PAGE_TEXT]
CAPTION=
1504=固定部分
1623=跳号
1624=日期时间
1343=设置...
1627=
1626=%Y/%m/%d,%H:%M:%S
1628=
1635=
1034=
1398=增加
1403=删除
1621=修改
2186=文本内容
1625=串口通讯
1629=网络通讯
2161=串口号:
2162=波特率:
2163=数据位:
2164=停止位:
2165=校验位:
2166=命令:
2167=IP地址：
2168=端口号：
2155=参数
2170=Unicode
2171=超时：
2173=ms
2174=通讯文本设置

[IDD_SPLASH]
CAPTION=

[IDD_DIALOG_PROPRETY]
CAPTION=
1248=
1250=取0层打标参数
1260=
1258=另存为
1262=删除
1263=设默认值
1541=选中打标
1256=List2
1403=
1404=
1405=
1406=
1407=
1408=
1409=
1682=填充
1662=Tab1
1264=光斑

[IDD_MARK_DIALOG]
CAPTION=
2175=红光(F1)
2052=快速打标
2053=通用打标
2054=多文档打标
2085=[S]选择加工
2055=参数
1740=[C]连续加工
2093=0
2094=1
2092=R
1741=红光显示轮廓
1742=红光连续模式
2095=0:0: 0.000s
2096=00:00:00s
2131=
2134=多卡打标
2153=零件：
2154=总数：
2420=控制卡：
2167=IDD_MARK_DIALOG_COMBOBOX_0

[IDD_DIALOG_OBJECT_LIST]
CAPTION=
1034=List1

[IDD_DIALOG_OBJEDITFILL]
CAPTION=
1821=填充1
1822=填充2
2033=填充3
1825=填充线随轮廓旋转
1162=
1029=
1828=
1826=等间距填充
1827=
1831=
1830=
1829=
1820=使能填充
1823=
1657=
1649=
1632=删除缩进轮廓
1658=
1833=删除填充线
1836=先打填充
1850=累进
1526=光斑对齐
1834=
2031=环形向外
2032=随机首点
2056=先填充同一边
2077=只打填充
2213=间距(mm)
2287=起始偏移(mm):
2104=角度(度)
2239=光斑大小(mm):
2286=最小跳转间距(mm):
2290=线首点缩进(mm):
2288=末尾偏移(mm):
2196=类型
2292=缩扩圈数:
2291=线尾点缩进(mm):
2182=缩扩间距(mm):

[IDD_TEXTEDIT_DLG]
CAPTION=
1034=
1765=增加
1763=删除
1825=文本类型
1822=IDD_TEXTEDIT_DLG_COMBOBOX_0
1635=
1626=
1343=跳号设置....
1627=TEXT
1628=
1507=可变文本
1801=
1823=字体类型
1824=IDD_TEXTEDIT_DLG_COMBOBOX_1
1809=字体文件
1331=
1344=TTF设置....
1807=中   文:
1328=
1808=英   文:
1329=
1475=数   字:
1330=
1828=字高(mm)
1013=
1766=高级
1821=
1827=
1826=
1764=修改
1820=
1830=
1829= TTF...
1846=中文:
1847=英文/数字:
1845=
1031=
2072=字体文件
2073=
2500=扩展属性
681=别名
61567=日志

[IDD_TEXTEDIT_DLG_FONTTYPE]
61498=TTF 字体
61499=SHX 字体
61500=自定义字体
61511=点阵字体
61546=Fnt 字体

[IDD_TEXTEDIT_DLG_TEXTTYPE]
61495=固定文本
61496=跳号
61497=时间日期
182=串口文本
183=网络文本

[IDD_DIALOG_BAREDIT]
CAPTION=
1820=
1030=
2180=条码类型                
1398=设置
1034=
1765=增加
1763=删除
1825=文本类型
1822=IDD_DIALOG_BAREDIT_COMBOBOX_1
1635=
1626=
1343=跳号设置....
1627=
1628=
1507=可变文本
1801=
1766=高级
1764=修改
2188=条码类型
2210=扩展属性
2211=别名

[IDD_SET_NODEDELAY]
CAPTION=
1389=0
2467=延时时长(ms):

[IDD_SET_NODEINPUT]
CAPTION=
1499=
1015=
1016=
1017=
1018=
1019=
1020=
1021=
1022=
1023=
1024=
1025=
1026=
1027=
1028=
1029=
1014=
1030=
1031=
1032=
1033=
1034=
1035=
1036=
1037=
1038=
1039=
1040=
1041=
1042=
1043=
1044=
2468=有效位
2469=设定值

[IDD_SET_NODEOUTPUT]
CAPTION=
1499=
1015=
1016=
1017=
1018=
1019=
1020=
1021=
1022=
1023=
1024=
1025=
1026=
1027=
1028=
1029=
1014=
1030=
1031=
1032=
1033=
1034=
1035=
1036=
1037=
1038=
1039=
1040=
1041=
1042=
1043=
1044=
1500=
1045=
1046=
1047=
1048=
1049=
1050=
1051=
1052=
1053=
1054=
1055=
1056=
1057=
1058=
1059=
1060=
1061=
1062=
1063=
1064=
1065=
1066=
1067=
1068=
1069=
1070=
1071=
1072=
1073=
1074=
1075=
1389=
2468=有效位
2469=设定值
2349=脉宽
2470=信号时长(ms):
2471=时长为0时输出电平信号


[IDD_DIALOG_OBJINFO_ARC]
CAPTION=
1502=
1503=
1504=
1505=
1506=
1507=
1508=
1510=
1511=
2294=起点X坐标(mm)
2295=起点Y坐标(mm)
2296=圆心X坐标(mm)
2297=圆心Y坐标(mm)
2298=端点X坐标(mm)
2299=端点Y坐标(mm)
2300=圆弧半径(mm)
2301=起点角度(度)
2302=端点角度(度)

[IDD_DIALOG_OBJINFO_CIRCLE]
CAPTION=
1504=
1505=
1072=
2315=圆心X坐标(mm)
2316=圆心Y坐标(mm)
2317=半     径(mm)

[IDD_DIALOG_OBJINFO_MOTORPOS]
CAPTION=
1502=
1868=
1503=
1869=
1504=
1870=
1505=
1871=
2322=0轴位置
2323=1轴位置
2324=2轴位置
2325=3轴位置
2501=mm
2502=mm
2503=mm
2504=mm

[IDD_DIALOG_OBJINFO_BUFFER_LASER]
CAPTION=
1882=关闭激光
1959=打开激光
1507=
1503=
1217=
1013=
1506=
2303=控制属性
2304=激光参数
2305=Q频(KHZ)
2306=Q释放(us)
2307=电流(A)
2308=能量(%)
2309=模式

[IDD_DIALOG_OBJINFO_CCD]
CAPTION=
1506=
1012=
1504=
1963=指定拍照位置
1070=
1071=
1030=IDD_DIALOG_OBJINFO_CCD_COMBOBOX_0
1031=
1505=
2310=模 板 号
2311=重试次数
2312=超时时间
2313=NG处理
2222=波 特 率
2314=跳转延时
2065=X(mm)
2066=Y(mm)

[IDD_DIALOG_OBJ_POSCALI]
CAPTION=
1962=结束校正
2500=启用校正
2283=校正类型

[IDD_DIALOG_EDITFILL]
CAPTION=
1732=应用(&A)
1662=Tab1
1764=快速打标(F7)
1795=选中下载(F11)

[IDD_MARK_NORMAL]
CAPTION=普通打标方式
1013=开始(&M)
1014=中止(&E)
2=退出(&X)
1012=
1492=打标
1634=红光预览
1543=边框预览
2422=打标总数:
1413=打标个数:
2405=单个时间:
1475=
1263=
2423=总 时 间:
2436=空闲时间:
1414=打标时间:
1264=0:0:0:0.000
1265=0:00:00:00
1266=0:00:00:00
1267=0:00:00:00
1396=刷新界面
2433=工作模式:
1740=循环打标
1502=
2425=间隔时间(ms):
1034=
1794=
1803=
1804=
1724=红光
1903=电机复位
1742=红光连续模式
2208=数据统计

[IDD_CALI_3DBOX]
CAPTION=三维Box补偿
1013=打标
2006=
1503=
1258=保存退出
2005=
1173=
1174=
2173=1.校正设置
1260=生成校正级别
2174=2.打标测量实测值
1820=3D Box 校正使能
1261=生成校正文件
1822=对焦
2169=BOX(mm)
2170=Z min(mm)
2171=Z max(mm)
2172=间隔(mm)

[IDD_DIALOG_3DALIGN]
CAPTION=模型移动
1070=
1071=
1172=
1927=x
1928=y
1929=z
1925=模型中心
1900=移动
1901=退出

[IDD_DIALOG_3DMARK_ADJUST]
CAPTION=3D打标调试
2198=STL模型高级贴图
2201=对位、对焦
2002=static
2199=贴图引线:
2003=
2200=贴图间距:
1162=
2001=贴图预览
1019=应用
2005=红光预览
1020=打标
2004=
2203=3D采样点:
2007=边框对位、对焦模式
2179=精度:
1502=
2202=模型移动:
2006=
1259=移动
2009=Y+
2010=X+
2011=Y-
2012=X-

[IDD_DIALOG_ADDFILLSET]
CAPTION=累进填充设置
1=确定(&O)
2=取消(&C)
2204=填充次数(次)
2205=累进间距(mm)
2206=累进角度(度)
1220=
1503=
1504=
1877=补打填充线边框

[IDD_DIALOG_ADDUSER]
CAPTION=增加用户
1=确定
2=取消
2207=用户名:
1502=
2208=密码:
1503=
2209=确认密码:
1504=

[IDD_DIALOG_BROADEN]
CAPTION=加粗设置
1=确定(&O)
2=取消(&C)
1750=线宽:
1196=
2213=间距:
1504=

[IDD_DIALOG_CHANGECARD]
CAPTION=切换控制卡
1=确定
2=取消
1908=
2214=请选择您需要使用的控制卡:

[IDD_DIALOG_CHANGEOBJNAME]
CAPTION=重命名
1=确定(&O)
2=取消(&C)
2215=新名称:
1502=

[IDD_DIALOG_CHECKLICENCE]
CAPTION=Check License
2057=
2058=
2217=软件狗ID：
2059=NULL
2218=物料编码：
1220=NULL
2216=提示信息：
2061=
2219=当前定制软件首套免License加密狗ID：
2062=

[IDD_DIALOG_COMSET]
CAPTION=打标串口输出设置
1=确定
2=取消
2034=启用
2221=串口号：
2222=波特率：
2223=数据位：
2224=停止位：
2225=检验位：
2035=
2036=
2037=
2038=
2039=
2045=打标开始时
2046=打标结束时
2047=进入打标环境时
2048=退出打标环境时
1502=
2220=命令：

[IDD_DIALOG_CONNECTSPACE]
CAPTION=设置连接间隙
1=确定
2=取消
2226=连接间隙：
1162=

[IDD_DIALOG_DCPMSG]
CAPTION=打标卡状态
1=确定
2=取消
1723=关闭软件
1724=红光
1725=
1728=

[IDD_DIALOG_EDITUSERNAME]
CAPTION=修改用户名
1=确认
2=取消
2227=用户名:
1711=
2228=新用户名:
1503=
[IDD_DIALOG_EDITUSERRIGHTPASSWORD]
CAPTION=修改帐户密码
1=确认
2=取消
2207=用户名:
1502=
2230=新密码:
1709=
2231=确认密码:
1710=
2229=旧密码:
1505=

[IDD_DIALOG_EXCELTOTXT]
CAPTION=Excel转Txt
1=生成TXT
2017=
2018=导入Excel数据
2019=刷新数据
2020=
2021=
2022=起始行：
2023=起始列：
2024=
2179=文件路径：
2025=获取列：
2026=

[IDD_DIALOG_MOVEMARK_SET]
CAPTION=
1=确定
2=取消
2273=工件打标面直径(mm)
2274=打标角度(deg)
2272=圆周
2275=X方向中心点偏移(mm)
2279=编码器每转脉冲数(脉冲/转)
2269=平移
2270=有效范围(mm)
1976=圆周切分打标
1403=
1404=
2271=位置反馈脉冲(脉冲/mm)
2280=编码器延时(us)
2276=(文档参数)
2277=(文档参数)
2278=(文档参数)
2153=自动获取

[IDD_DIALOG_EXTERNVIEW]
CAPTION=缩扩对象
1=确定
2=取消
1746=
1682=
1750=线间距：
1751=缩扩边
1726=删除原来对象
684 =应用
1748=说明：线间距为正，则对象往外扩大，否则，对象往内缩小。
1672=适用页面
1749=是否优化
1415=高级缩扩

[IDD_DIALOG_FASTMARKSTOP]
CAPTION=
1=停止
1392=

[IDD_DIALOG_FILLOBJMARKSET]
CAPTION=
1737=
1738=打边框
1736=打填充
1743=先打填充
1502=
1734=
2235=编辑每次打标方式
2236=参数选择:
2234=对象打标次数:
1413=打标次数:
1034=List1
1744=
1745=启用
1690=保存
1742=
1691=删除
1746=反序打标

[IDD_DIALOG_INTENSITY]
CAPTION=灰度直方图
1=确定
2=取消
2237=灰度显示范围:
1634=
1635=
1636=
1881=List2

[IDD_DIALOG_INTERSPACE]
CAPTION=交点过滤
1=确定(&O)
2=取消(&C)
2238=交叉点长度
1502=

[IDD_DIALOG_LASERDOT]
CAPTION=光斑大小
1=确定
2=取消
1897=
2239=光斑大小:
1196=
2240=速度:
1503=
2241=频率:
1011=
2242=光斑间距:
1504=
1970=速度不变
1971=频率不变
1972=间距不变
1267=
1969=

[IDD_DIALOG_MODEL]
CAPTION=造型
1956=
2137=
1957=
2138=
2139=焊接
2140=保留原始对象
2141=保留目标对象
1414=焊接

[IDD_DIALOG_MODIFYZ]
CAPTION=设置坐标
1=确定
2=取消
2245=Z坐标:
1172=
2244=Y坐标:
2243=X坐标:
1071=
1070=

[IDD_DIALOG_MOTIONINFO_SET]
CAPTION=运动参数设置
1867=绝对运动
2501=相对运动
1545=回机械零点
1=保存退出(&O)
2=退出(&C)
2247=轴  号
1864=
1853=IDD_DIALOG_MOTIONINFO_SET_COMBOBOX_1
2248=运动轴类型
2259=螺间距(mm):
1502=
2250=运动完成后延时(ms)
1389=
2254=电机转动方向
1865=正向
1394=反向
2261=平移空程速度(mm/s):
1855=
2260=平移工作速度(mm/s):
1856=
2262=平移回零高速度(mm/s):
1857=
2263=平移回零低速度(mm/s):
1858=
2257=旋转空程速度(deg/s)
2256=旋转工作速度(deg/s)
1859=
1860=
2252=空程加速时间(s)
1861=
2251=工作加速时间(s)
2253=回零减速时间(s)
1862=
1863=
2249=每转脉冲数
1503=
2246=基本参数
2258=直线运动
2255=旋转运动
2264=运动测试
2267=运动量(deg/mm):
1878=
1153=运动测试
2265=运动模式:
2266=运动类型:
1880=带负载运动
1544=空程运动
1901=设置当前位置为软件原点
1902=软件启动自动回软件原点
1905=运动轴使能
1019=参数应用(&A)
1906=机械原点使能
2167 = 检测限位

[IDD_DIALOG_MOTIONINFO_SET_COMBOBOX_1]
0=平移轴
1=旋转轴


[IDD_DIALOG_NOTADMIN]
CAPTION=非管理员运行警告
1978=本机操作系统为Win7及以上，软件没有以管理员权限运行时，必须给软件目录赋读写权限，否则可能运行不正常!
2000=下次启动软件,不再提示
1=确定

[IDD_DIALOG_OBJ_PRECISIONSET]
CAPTION=精度设置
1=确定
2=取消
2284=拟合精度
2285=每段采样数
1502=
1819=

[IDD_DIALOG_OBJ_TRANSFORM]
CAPTION=变换
2100=
2099=
2101=
2102=
2103=
2104=角度
1029=
2106=
2107=位置
2065=X
1070=
2109=
1071=
2111=
2105=°
2066=Y
2108=mm
2110=mm
2112=
2127=镜像
2113=
2114=
2115=相对位置
2116=(mm,mm)
2117=
2118=
2119=
2120=
2121=
2122=
2123=
2124=
2125=
2126=应用至复制对象(C)
1414=应用

[IDD_DIALOG_PARABTN]
CAPTION=参数
1=退出
2086=设置区域
2055=激光器设置
2087=软硬件信息

[IDD_DIALOG_PATHOPTIMIZE_SET]
CAPTION=选择快速排序属性
1=确定
2=取消
2328=Select Quick Sort Properties
1492=stroke first
1394=lay first
1835=The line sorting path is optimal, with the possibility of frequent layer changes. The layer sorting is based on layer order and objects within each layer are sorted, suitable for overlaying graphics. The line sorting path is optimal, with the possibility of frequent layer changes. The layer sorting is based on layer order and objects within each layer are sorted, suitable for overlaying graphics

  
[IDD_DIALOG_PORTSET]
CAPTION=端口设置
1=确定
2=取消
2329=停止加工输入端口
2085=
1501=
1502=
1503=
1504=
1505=
1506=
2332=安全门
2333=输入端口
2074=
2051=
2334=激光器准备好输出口
2335=输入端口
2075=
2052=
2336=输出端口
2076=
2053=
2341=外部红光指示输出
2342=输出端口
2077=
2054=
2343=输入端口
2078=
2055=
2339=激光电源输出口
2340=端口
2079=
2056=
2345=打标伴随输出
2346=输出端口
2080=
2057=
2347=标刻结束输出口
2348=输出端口
2081=
2058=
2331=输出端口
2330=停止加工时输出口
2083=
2060=
1507=检测激光器报警
2086=
2087=
2088=
2089=
2090=
2091=
2092=
2353=输入端口
2350=光纤激光器报警输出口
2084=
2061=
2349=脉冲宽度
2093=
1508=Q信号电平反转
2351=输出端口
2082=
2059=
2352=开始标刻端口
2337=软件就绪输出口
2338=输出端口
2095=
2099=
2183=停止加工时输出口
2184=输出端口
2185=软件就绪输出口
2186=输出端口
2187=输入端口

[IDD_DIALOG_PROWAIT]
CAPTION=旋转数据处理
1403=中止(&S)
1877=数据处理中，请耐心等待.....................

[IDD_DIALOG_REMOVESAMELINE]
CAPTION=删除重线
2050=
1014=中止
2052=尺寸(mm):
2053=删除冗余的小对象
2054=
2051=开始
2055=取消

[IDD_DIALOG_RESETCARDNAME]
CAPTION=设置卡别名
2233=卡ID
2131 =
2211=别名
2133=
2132=修改

[IDD_DIALOG_ROTATEWHEEL_SET]
CAPTION=旋转打标设置
1=确定
2=取消
2354=工件打标面直径(mm)
2355=轮廓切分角度(deg)
1502=
1503=
2356=填充线每次标记根数
1504=
2276=(文档参数)
2277=(文档参数)
2278=(文档参数)
2152=电机轴线垂直X轴
2153=电机轴线平行X轴

[IDD_DIALOG_RULER]
CAPTION=标尺编辑
1=确认
2=取消
2188=刻度类型
1882=圆周刻度
1394=平面刻度
2357=圆周直径(mm):
2358=刻度间距(度):
2293=刻度间距(mm):
1502=
1883=
1884=
1897=
2359=刻度参数
2360=刻度起始值
1193=
2362=刻度总根数
1886=
2361=刻度增量
1887=
1894=丢弃最后一根刻度
1893=List3
1384=上移
1385=下移
1220=设置
1899=上对齐
1898=下对齐
1900=
114=MINI

[IDD_DIALOG_RULEROBJ_SET]
CAPTION=刻度线设置
1=确定
2=取消
2363=间隔数
2364=小数位数
1502=
1504=
1896=显示刻度数字

[IDD_DIALOG_SETLINEPOS]
CAPTION=设置测量线的位置
1=确定
1502=

[IDD_DIALOG_SETSORT]
CAPTION=请输入新序号
1718=修改顺序
1719=对调顺序
1502=
1=确定
2=取消
1720=请输入新序号:

[IDD_DIALOG_SetSwing]
CAPTION=摆动设置
1=确定
2=取消
2196=类型
2241=频率
2365=垂直振幅
2366=水平振幅
2143=
2144=
2145=
3000 =IDD_DIALOG_SetSwing_COMBOBOX_0
2146=
2147=
2148=
2150=峰间距:
2151=起始角度：
2149=当前打标速度:
2152=mm（范围：>=1）
682 =mm（范围：>0）
2154=mm（范围：>0）
2155=mm（范围：>=0）

[IDD_DIALOG_SetSwing_COMBOBOX_0]
0=无
1=正弦
2=圆

[IDD_DIALOG_SORTOBJ_LAY]
CAPTION=按图层排序
1=确定
2=取消
2064=
1384=上移
1385=下移

[IDD_DIALOG_SPIRAL_SET]
CAPTION=螺旋线设置
1=确定
2=取消
2367=螺距：
2368=最小半径：
2369=最大半径：
2370=螺距增加量：
2049=添加内圈
2050=添加外圈
2051=由外往内
2052=
2053=
2054=
1503=

[IDD_DIALOG_TESTLASER]
CAPTION=测试激光
1=确定
2=取消
2103=
1503=
1504=
1505=
2375=频率(Q频)
2376=功率
2307=电流
2378=激光开启时间
1433=开激光
1506=
2128=激光脉宽

[IDD_DIALOG_TEXTREPLACE]
CAPTION=批量替换文本内容
1=确定
2=取消
2211=别名:
2002=
2379=内容:
2003=

[IDD_DIALOG_TRANBMP]
CAPTION=矢量转定制设置
1=确定
2=取消
2380=转换间距(mm)：
1162=
1649=打标往复
1505=
2385=往复对齐补偿:
1506=
2382=行合并容差:
1507=
2384=列转换偏差值:
1650=列再分割使能
2381=边界外扩(mm)：
1163=
1508=
2386=转换后图层:
2383=示例间距(mm)：
2049=

[IDD_DIALOG_TRANSFORM]
CAPTION=3D变换
1911=
1915=
1917=
1916=
2388=移动（mm）
2065=X
2066=Y
2104=角度：
2067=Z
2151=旋转
1492=绝对坐标（中心点）
1394=相对总偏移量
2501=绕Z轴
2500=绕X轴
1544=绕Y轴
1019=应用
2=退出
2389=基准偏移
1502=
1912=设为基准
2387=变换类型
1953=仅3D模型
1546=2D对象随3D模型动
1547=2D数据变换成3D
1978=提示：旋转中心为3D模型中心点，绕X/Y/Z方向旋转。
2051=清空
2104=Angle

[IDD_DIALOG_USER_LOGIN]
CAPTION=用户登录
1461=
1=登录
2=取消
2207=用户名:
2208=密码:
1715=
1331=

[IDD_DIALOG_USERRIGHTCFGMNG]
CAPTION=用户权限管理
1=确定
2=取消
1697=通用打标
1698=多文档打标
1699=创建对象
1700=对象编辑
1701=系统设置
1702=校正设置
1703=文件保存
1704=打开文档
1696=层参数设置
1706=管理员
2390=权限选择
1707=List2
1713=默认用户
1714=导入
1715=导出
1705=高级参数

[IDD_DLG_LANGUAGETYPE]
CAPTION=语言选择
1=确定
2=取消
2148=Chinese(Simplified)- 简体中文
2391=语言类型：
2392=下次重启才生效，是否立即重启？

[IDD_DRAW_DIB]
CAPTION=位图设置
1493=灰度图像
1657=二值图像
1658=灰度点阵
1292=反色
1298=
1717=
1649=往复
1505=
1508=
1510=
1506=
1398=灰度电流较正
1=确定
2=取消
2196=提示:点间距=K*单步距离(K为大于等于2的整数),单步距离=打标速度/100000。
2401=加速点数(个):
1504=
1502=
2395=图像名称:
1304=
2399=打标设置
2405=单点时间(us):
2241=Q频(KHz):
2400=点对齐补偿:
2367=点间距(mm):
2396=位图设置:
2397=对比度(-1～1):
2398=明亮度(-1～1):
1509=
1511=
2403=最小:
2404=最大:
2402=激光关延时(us):
2010=灰度二值
2406=打标方向
1645=行优先
2011=列优先
2049=自动计算 (保持图片分辨率)
1650=整行跳白 灰度阈值(0~255)
1651=首尾跳白

[IDD_DRAW_FILL]
CAPTION=填充设置
1821=填充1
1822=填充2
2033=填充3
1=确认
2=取消
1825=填充线随轮廓旋转
2407=填充间距(mm)
2287=起始偏移(mm):
2104=角度(度)
1162=
1029=
1828=
1826=等间距填充
2239=光斑大小(mm):
1827=
1831=
2408=最小跳转间距(mm):
1830=
2290=线首点缩进(mm):
1829=
2288=末尾偏移(mm):
1820=使能填充
2196=类型
1823=
2292=缩扩圈数:
1657=
1649=
1632=删除生成的轮廓
2293=缩扩间距(mm):
1658=
1833=删除生成的填充线
1836=先打填充
1850=累进填充
1526=光斑对齐
1834=
2291=线尾点缩进(mm):
2031=环形填充向外
2032=环形随机首点
2056=先填充同一边
2077=只打填充

[IDD_DRAW_GRID]
CAPTION=网格设置
1=确定
2=取消
2161=行数:
1218=
2162=列数:
1219=
2409=行列数

[IDD_DRAW_POLYGON]
CAPTION=多边形设置
1220=
1234=
1221=多边形
1222=星形多边形
1223=交叉星形多边形
1238=
1232=
1=确定
2=取消
2411=多边形风格
2410=多边形边数：
2412=清晰度

[IDD_ELLIPSET]
CAPTION=椭圆量取尺寸设置
1=确定
2=取消
2413=量取尺寸
1502=
2414=说明：量取尺寸越小，椭圆越精细。

[IDD_EXPORTPLT]
CAPTION=
1670=不导填充
1671=放大100倍导出

[IDD_FILEREPLYRENAME]
CAPTION=Dialog
1=替换
2=重命名
1658=

[IDD_GRAYCOMPENSATE]
CAPTION=灰度非线性补偿
1660=
1659=
1=确定
2=取消
1267=
1268=
1269=
1270=
1271=
1272=
1502=
1503=
1504=
1505=
1506=
1507=
1508=
1509=
1510=
1511=
1512=
1513=
3=默认

[IDD_HELPPATH]
CAPTION=关于帮助文件
1978=请参考："开始"->"程序"->"Hans Laser Application -> Hans Laser Marking software"->"UserManual"

[IDD_IMPORT]
CAPTION=
1549=导入居中
1550=导入优化
1818=预览
1817=预览
1967=普通轮廓线条
1394=完整转换，生成填充线
1965=X
2500=Y
2416=填充方向
2407=填充间距(mm)
1966=
2415=连接距离(mm)
1968=
1551=自动连接

[IDD_MAKECP_SET]
CAPTION=设置
1680=
1=确定
2418=环数：
2417=锥形再制

[IDD_MARK_MULCARD]
CAPTION=多卡打标
1014=选中卡停止
2=退出
1492=打标
1634=红光预览
1543=边框预览
1012=
1407=键盘,鼠标或脚踏触发
1413=打标个数:
2429=单个时间:
2423=整体时间:
1462=0
1463=0: 0: 0: 0.000
1464=0: 0: 0: 0.000
2430=工作模式
1793=循环打标
1502=
2425=间隔时间(ms):
2426=卡列表:
1386=
2427=关联文档:
1388=
2428=文档列表:
1277=加入关联
1278=删除关联
1015=全部开始
1016=全部停止
2075=
2130=选中卡开始
1279=保存多卡文档
2177=启用
2184=打标文档:
2178=保存多文档
2183=IO输入信号选文档模式
2179=上移
2180=下移
2055=输入信号
2181=可选项
2182=工作记录

[IDD_MARK_FLY]
CAPTION=飞行打标方式
1013=开始(&M)
1014=中止(&E)
2=退出(&X)
1012=
1492=打标
1634=红光预览
1543=边框预览
2421=打标统计
2422=打标总数:
1413=打标个数:
2405=单个打标时间:
1475=0
1263=0
2423=总 时 间:
1264=0: 0: 0: 0.000
1265=0:00:00:00
1396=刷新界面
2424=激光模式:
1740=循环打标
1502=
2425=间隔时间:
1034=
1794=
1803=
1804=
1724=红光
2076=IO触发自动打标
2213=间距:
2135=启用等间距
2136=
2147=

[IDD_MARK_PREVIEW]
CAPTION=打标预览
114=MINI
2438=预览速度
1268=开始
1014=停止
1267=

[IDD_MARK_SPECIAL]
CAPTION=外部信号选择文档打标
1013=开始(&M)
1014=中止
2=退出
1383=
1384=上移
1385=下移
1276=删除
1220=属性...
1012=
2439=文档设置
1258=保存...
1413=打标个数:
2405=单个时间:
2423=整体时间:
1462=0
1463=0: 0: 0: 0.000
1464=0: 0: 0: 0.000
1620=111111111
1398=测试IO
1622=打标当前选中文档
2441=调试
2203=数据统计
1623=文档信号在脚踏触发前发出
2440=信号来源
2500=文档信号在脚踏触发后发出
1624=
2442=打标文档:
1492=打标
1634=红光预览
1543=边框预览
2433=工作模式
1666=

[IDD_MARK_WHEEL]
CAPTION=圆周旋转打标
1870=旋转打标信息统计
2422=打标总数:
1475=
2423=总 时 间:
1265=0:00:00:00
1413=打标个数:
1263=
2436=空闲时间:
1266=0:00:00:00
2405=单个时间:
1264=0: 0: 0: 0.000
1414=打标时间:
1267=0:00:00:00
1403=
2433=工作模式：
1492=打标
1634=红光预览
1852=无损(以对象为单位进行分块标记)
1394=等角度轮廓(只标记轮廓，忽略填充线)
1395=等角度综合(标记轮廓和垂直填充线)
1012=
1396=刷新界面
1869=打标完成后电机回零
1794=
1724=红光
1013=开始(&M)
1014=中止(&E)
2=退出(&X)
1740=循环打标
1502=
1034=
1803=
1804=
2444=打标类型
1903=电机复位
2188=画线分离(以画线的区域进行分块标记) 

[IDD_MARKDATA_STAT]
CAPTION=打标数据统计
1=确定
2445=统计起始日期：
2422=总打标次数：
2446=总打标时间：
1365=
1413=
1414=

[IDD_MOVE_DLG]
CAPTION=精确移动
1502=
1503=
1504=
1683=上
1684=下
1685=左
1686=右
1=确定
1940=步长:
1763=打标
2065=X direction (mm):
2066=Y direction (mm):

[IDD_PENSELECT_DIALOG]
CAPTION=按笔号选择
1=确定
2=取消
2088=

[IDD_SET_AZTEC]
CAPTION=Aztec
1=确定
2=取消
2002=纠错级别
1030=
1960=
2003=版本

[IDD_TEXT_PAGE_FNT]
CAPTION=
1809=字体文件
1331=
1838=精度:
1330=
1344=TTF设置
1328=
1329=
1013=
1345=
1346=
1309=
2486=字高(mm)
2488=宽度系数(%)
2487=字间距(mm)
1807=中文:
1808=英文:
1475=数字:
2485=字形
2489=行间距(mm)
1681=
1310=
1499=字符等间距:
1839=
1840=
1842=TTF
1841=SHX
1843=CUSTOM
1844=MATRIX
1846=中文:
1847=英文/数字:
1845=
1031=
1956=自动焊接
1957=自动过滤焦点
1311=
2213=间距:
1958=加粗
1312=
1313=
1976=点半径
1314=
1315=
1977=填充间距
1959=自动连线
1823=字体类型:
1824=IDD_TEXT_PAGE_FNT_COMBOBOX_6
2071=Fnt
2072=字体文件
2073=
2206=间距:
2207=线宽:

[IDD_TEXT_PAGE_ROUND]
CAPTION=
1023=直线排布
1323=圆弧排布
1347=左对齐
1348=右对齐
1322=中间对齐
1005=0
1196=0
1193=0
1312=逆时针方向
2317=半径(mm):
2491=开始角(度):
1350=字符朝内
2490=方向(度):
1499=自定义字串格式
1502=
2492=(X输出字符,N删除字符)
1964=反刻
1349=水平
1351=垂直

[IDD_SET_BARTEXT]
CAPTION=条码文本设置
1=确定
2=取消
1026=Tab1
2379=文本内容
1508=

[IDD_SET_DATAMATRIX2D]
CAPTION=DataMatrix二维码设置
1=确认
2=取消
2447=根据条形码准则确定下列参数：
1476=纠错类型:
1030=
2279=编码格式:
1954=
2450=大小：
1955=

[IDD_SET_FLY]
CAPTION=飞行打标设置
1=确定
2=取消
1492=流水线恒速飞行
1493=编码轮测速飞行
2451=流水线恒定速度(mm/s):
1502=
2452=测速编码轮直径(mm):
1503=
2453=测速编码轮每转脉冲数:
1504=
1499=流水线反向
2051=开始
2454=编码器测试
2455=流水线速度(mm/s):
1505=
2456=编码器位置（脉冲）:
1506=

[IDD_SET_GRIDMATRIX]
CAPTION=GridMatrix 二维码设置
1=确定
2=取消
2457=版本
2458=纠错级别
2027=
2028=

[IDD_SET_HANXINCODE]
CAPTION=汉信码设置
1=确定
2=取消
2457=版本
2458=纠错级别
1030=
1960=
2459=汉信码编码模块由北京仁聚智汇科技发展有限公司提供

[IDD_SET_IO]
CAPTION=设置文档对应信号
1=确定
2=取消
1502=
1731=获取当前信号 ( I9 - I1 )
2460=信号设置    (注意：输入口是0有效)
1499=
1015=
1016=
1017=
1018=
1019=
1020=
1021=
1022=

[IDD_SET_LANGREGION]
CAPTION=选择语言
1=确定
2=取消
1001=
2459=当前文件是一个老版本格式文件，请指定该文件字符所使用语言

[IDD_SET_LAY]
CAPTION=层设置
1=确认
2=取消
2461=选中部分移至第
2464=层
1543=
2462=选中填充线部分移至第
2465=层
1544=
2463=选中缩进轮廓部分移至第
2466=层
1545=

[IDD_SET_PDF4172D]
CAPTION=PDF417二维码设置
1=确认
2=取消
1027=条码行数:
1495=
2472=根据条形码准则确定下列参数：
2204=(3~~90或0)
2458=纠错级别
1030=

[IDD_SET_QR2D]
CAPTION=QR条码设置
1=确认
2=取消
1605=
2450=条码大小：
2474=纠错级别：
1604=
2473=根据条形码准则确定下列参数：
2475=编码模式：
1952=IDD_SET_QR2D_COMBOBOX_2

[IDD_SET_QR2D_COMBOBOX_2]
0=数字
1=混合字符
2=8位字节
3=日本汉字
4=中国汉字
5=混合编码
6=GS1

[IDD_SET_RECTANGLE]
CAPTION=矩形设置
1589=普通
1590=倒圆
1591=倒角
1592=
1=确定
2=取消
2476=倒圆半径/倒角尺寸(mm)
2192 = 圆角程度
2184 = 全部边角圆形


[IDD_SET_RUN]
CAPTION=运动设置
1=确定
2=取消
2477=轴号：
1864=
1867=绝对运动
1394=相对运动
2478=运动模式
2321=旋转运动量(度)
2320=线性运动量(mm)
1502=
1866=
2479=运动类型
1543=带负载运动
1544=空程运动
1545=回零

[IDD_SET_TRACKER]
CAPTION=设置跟踪器属性
1004=虚线
1003=实线
1009=
1007=轮廓线内
1008=轮廓线外
104=
1=确定
2=取消
2483=控制点大小:
2481=轮廓线
2482=控制点

[IDD_SET_USERDEFINE]
CAPTION=用户自定义条码设置
1=确定
2=取消
2012=行数：
2013=列数：
2014=
2015=
2016=说明：用户自定义条码，用户可自定义行列数(默认为16x16)，支持处理二进制、十进制和十六进制的输入数据，输入二进制数则只能包含"01"("0"-白，"1"-黑)，十进制数需以","分隔，十六进制数需包含"0x"，二进制数的前8位、十进制数的第一个和十六进制的前两位对应二维码从上到下、从左到右数的前8位条码块，以此类推可表示所有条码块内容。

[IDD_STYLE_SAVE]
CAPTION=保存方案
1187=
1=确定
2=取消
2484=参数方案另存为：

[IDD_TEXT_PAGE_TEXT]
CAPTION=
1628=
2172=
2151=
1504=固定部分
1623=跳号
1624=日期时间
1625=串口通讯
1629=网络通讯
1343=设置...
1627=
1626=
1635=
2156=固定部分
2157=跳号
2160=串口通讯
2158=时间日期
2159=网络通讯
182=串口文本
183=网络文本
2146=
2147=
2148=
2149=
2150=
2161=串口号:
2162=波特率:
2163=数据位:
2164=停止位:
2165=校验位:
2166=命令:
2152=
2153=
2167=IP地址：
2168=端口号：
2155=参数
2170=Unicode
2171=超时：
2173=ms
2174=通讯文本设置

[IDD_BARCODE_DLG]
CAPTION=条码设置
1=确定
2=取消
1030=
2188=条码类型
1622=Tab1
1398=设置...
2156=条码类型

[IDD_DlgCustomAutoSortGrpList]
CAPTION=自动排序2
2394=排序方法:
2063=
2064=只排序选中的对象
2065=
2393=分块高度(mm):
2066=
3=执行排序
4=退出

[IDD_DIALOG_EXTENDFUNCTION_INFO]
CAPTION=扩展功能激活信息表
1=退出
1034=
2233=卡  号：
1502=
2211=别  名：
1911=
1912=修改

[IDD_DIALOG_OBJINFO_MOTORMOVE]
CAPTION=
2247=轴号：
1864=
1867=绝对运动
1394=相对运动
2318=运动模式
2321=旋转运动（度）
2320=线性运动（mm）
1502=
1866=
2319=运动类型
1543=工作动作
1544=空运动
1545=回零
65535=移动类型

[IDD_DIALOG_3DLOAD]
CAPTION=加载3D型号
1913=基本图形
1394=STL.STP.DXF或IGES
1914=IDD_DIALOG_3DLOAD_COMBOBOX_0
1502=
1912=
1918=
1159=
1919=
1160=
1922=
1923=
1941=添加
1672=删除
1414=修改
1911=
1943=绕Y轴
2501=绕X轴
1196=
1915=
1197=
1948=竖放
1916=
1947=
1034=
1=确定
2=取消
1924=参数
1926=位置0
1927=x
1928=y
1930=位置1
1931=x
1932=y
1929=Z
1933=z
1940=步骤
1925=倾斜
1934=球/锥度
1935=半径1
1936=长度
1939=半径2
1942=宽度
1944=新增对象
1938=列
1945=起始角度
1946=终止角度
1950=提示：角度范围为0至180。当锥形垂直放置时，为0-360。起始角必须大于停止角度
1549=自动居中
2069=
2175= 类型
2176= 文件
2209= 形状
1949 = 类型


[IDD_MARK_MULDOC]
CAPTION=多文档打标
1013=开始(M)
1014=终止
2=退出
1383=
1384=向上移动
1385=向下移动
1276=删除
1220=属性...
1258=保存...
1492=打标
1634=红光预览
1543=边框预览
1012=
1407=键盘，鼠标或脚踏触发
2202=间隔时间（MS）：
1462=
1463=0:0:0:0.000
1464=0:0:0:0.000
1793=循环打标
1502=100
1903=电机复位
2197=多个文档设置
1413=打标个数：
2199=单个时间：
2200=整体时间：
2201=打标模式

[IDD_TEXT_PAGE]
CAPTION=
1034=
1398=添加
1403=删除
1621=修改
1622=Tab1
2379=文本内容

[IDD_TEXT_BASEDLG]
CAPTION=文本条形码设置
1=确定
2=取消
1620=Tab1
1414=应用

[IDD_TEXT_SERIAL]
CAPTION=跳号设置
1193=
1002=
1012=
1199=
1215=
1220=设置...
1239=自定义
1240=取自于文件 (每一行)
1241=取自于文件 (第一行)
1268=
1269=
1270=补齐位数
1=确定
2=取消
1358=IDD_TEXT_SERIAL_COMBOBOX_0
1502=
1216=
1217=
1499=设定
1649=循环跳号
2074=
2051=选择...
1363=起点
1364=终点
2497=补齐前置字符
2496=跳号部分总长
1940=步长
2494=前置
2495=后置
2499=进制内容
2213=间隔：
2493=当前跳号打标次数

;Popup 快捷菜单模块
[IDR_POP]
IDR_POP_SUBMENU_0=通用
IDR_POP_SUBMENU_1=跳号
IDR_POP_SUBMENU_2=条码
IDR_POP_SUBMENU_3=位图
IDR_POP_SUBMENU_4=文本
IDR_POP_SUBMENU_5=层
IDR_POP_SUBMENU_6=对象列表
IDR_POP_SUBMENU_7=对象编辑
IDR_POP_SUBMENU_8=用户权限设置
IDR_POP_SUBMENU_9=样条曲线
IDR_POP_SUBMENU_10=圆弧
IDR_POP_SUBMENU_11=圆

[IDR_POP_SUBMENU_0]
32975=层设置(&Y)
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右镜像(&X)
32908=上下镜像(&Y)
32913=左旋90度(&L)
32914=右旋90度(&R)
0=----------------------
33016=精确移动(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=复制(&C)	Ctrl+C
32791=删除(&D)	Del
57637=粘贴(&P)	Ctrl+V
0=----------------------
33011=转为曲线(&F)
33040=对象合成(&U)	Alt+U
0=----------------------
57642=全选(&A)	Ctrl+A

[IDR_POP_SUBMENU_1]
32975=层设置(&Y)
0=----------------------
32936=跳号设置(&S)
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右镜像(&X)
32908=上下镜像(&Y)
32913=左旋90度(&L)
32914=右旋90度(&R)
0=----------------------
33016=精确移动(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=复制(&C)	Ctrl+C
32791=删除(&D)	Del
57637=粘贴(&P)	Ctrl+V
0=----------------------
33011=转为曲线(&F)
0=----------------------
57642=全选(&A)	Ctrl+A

[IDR_POP_SUBMENU_2]
32975=层设置(&Y)
0=----------------------
32936=条码文本设置(&S)
32998=创建条码文本(&H)
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右镜像(&X)
32908=上下镜像(&Y)
32913=左旋90度(&L)
32914=右旋90度(&R)
0=----------------------
33016=精确移动(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=复制(&C)	Ctrl+C
32791=删除(&D)	Del
57637=粘贴(&P)	Ctrl+V
0=----------------------
57642=全选(&A)	Ctrl+A

[IDR_POP_SUBMENU_3]
32975=层设置(&Y)
0=----------------------
32954=位图设置(&S)
33140=灰度直方图
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右镜像(&X)
32908=上下镜像(&Y)
32913=左旋90度(&L)
32914=右旋90度(&R)
0=----------------------
33016=精确移动(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=复制(&C)	Ctrl+C
32791=删除(&D)	Del
57637=粘贴(&P)	Ctrl+V
0=----------------------
57642=全选(&A)	Ctrl+A

[IDR_POP_SUBMENU_4]
32975=层设置(&Y)
0=----------------------
32936=文本设置(&S)
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右镜像(&X)
32908=上下镜像(&Y)
32913=左旋90度(&L)
32914=右旋90度(&R)
0=----------------------
33016=精确移动(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=复制(&C)	Ctrl+C
32791=删除(&D)	Del
57637=粘贴(&P)	Ctrl+V
0=----------------------
33011=转为曲线(&F)
0=----------------------
57642=全选(&A)	Ctrl+A

[IDR_POP_SUBMENU_5]
33012=颜色修改
33021=锁定当前层
33022=解锁当前层
33083=选中当前层
33084=选中当前层以外的层

[IDR_POP_SUBMENU_6]
33013=删除对象
33041=刷新对象列表
33088=向前移一位
33089=向后移一位
33090=移动到最前面
33091=移动到最后面
33143=对象重命名

[IDR_POP_SUBMENU_7]
33014=删除选中节点(&D)
33015=线条首尾连接(&C)
33016=精确移动(&M)
0=----------------------
33018=断点操作(&X)
33024=滤点(&F)
33028=导角(&V)
0=----------------------
33020=选中整个线条(&A)
33023=设置该点为闭合线的起点(&S)
33025=曲线反序(&R)
0=----------------------
33151=坐标编辑(&E)

[IDR_POP_SUBMENU_8]
33055=增加用户
33056=删除用户
33057=修改用户名
33058=修改密码

[IDR_POP_SUBMENU_9]
32975=层设置(&Y)
0=----------------------
33102=编辑样条曲线
33122=精度设置
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右镜像(&X)
32908=上下镜像(&Y)
32913=左旋90度(&L)
32914=右旋90度(&R)
0=----------------------
33016=精确移动(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=复制(&C)	Ctrl+C
32791=删除(&D)	Del
57637=粘贴(&P)	Ctrl+V
0=----------------------
33011=转为曲线(&F)
33040=对象合成(&U)	Alt+U
0=----------------------
57642=全选(&A)	Ctrl+A

[IDR_POP_SUBMENU_10]
32975=层设置(&Y)
0=----------------------
33119=编辑圆弧
33122=精度设置
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右镜像(&X)
32908=上下镜像(&Y)
32913=左旋90度(&L)
32914=右旋90度(&R)
0=----------------------
33016=精确移动(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=复制(&C)	Ctrl+C
32791=删除(&D)	Del
57637=粘贴(&P)	Ctrl+V
0=----------------------
33011=转为曲线(&F)
33040=对象合成(&U)	Alt+U
0=----------------------
57642=全选(&A)	Ctrl+A

[IDR_POP_SUBMENU_11]
32975=层设置(&Y)
0=----------------------
33121=编辑圆
33122=精度设置
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右镜像(&X)
32908=上下镜像(&Y)
32913=左旋90度(&L)
32914=右旋90度(&R)
0=----------------------
33016=精确移动(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=复制(&C)	Ctrl+C
32791=删除(&D)	Del
57637=粘贴(&P)	Ctrl+V
0=----------------------
33011=转为曲线(&F)
33040=对象合成(&U)	Alt+U
0=----------------------
57642=全选(&A)	Ctrl+A

;---------------------------------BEGIN: Bin\LaserSetDll.dll-----------------------------------------
[DIALOG_LASERSET]
0=激光器硬件参数设置向导
1=上一步
2=下一步
3=保存
4=取消

[DIALOG_POWER]
0=第二步：设置您所选激光器的硬件配置
1=电流调节范围(%)
2=最小电流(%):
3=最大电流(%):
4=模拟Q驱
5=数字Q驱
6=Q驱类型
7=电源类型
8=CO2激光器功率大小
9=普通电源
10=快速响应电源
11=大于或等于100W
12=小于100W
13=维持脉冲设置
14=频率(KHZ)
15=释放时间(us)
16=空闲电流(%):
17=最大占空比
18=补偿电流(%)
19=激光器硬件设置
20=M值设置
21=M值:
22=调整系数:
23=正常
24=过大
25=过小

[DIALOG_MODEL]
0=第四步：根据您的喜好，选择您喜欢的控制方式
1=一种全新的控制方式，操作简单，使用者不需设置任何延时,但只能在部分激光器上使用。
2=传统激光控制方式，符合大多数人的使用习惯，所有激光器都能使用此方式。
3=简便模式
4=传统模式
5=激光打标控制模式
6=方头类型
7=单头模式
8=双头模式

[DIALOG_LaserType]
0=激光器类型:
1=YAG激光器
2=DP激光器
3=紫外激光器
4=CO2激光器
5=调Q光纤激光器
6=SPI激光器
7=LD激光器
8=YLPM(HFM-H)激光器
9=YLP-V2激光器
10=YLPP激光器
11=HFM-A激光器
12=HFM-P激光器
13=HFM-R激光器
14=HFM-J激光器
15=MOPA可调脉宽激光器
16=连续光纤激光器
17=超快激光器


[DIALOG_CONTENT]
0=第五步：恭喜您，您的设置已经全部完成，请保存相关参数

[LaserType_Explain]
0=YAG激光器
1=DP激光器
2=紫外激光器
3=CO2激光器
4=调Q光纤激光器
5=SPI激光器
6=LD激光器
7=MoPa光纤激光器
8=YLP-V2激光器
9=YLPP激光器
10=HFM-A激光器
11=HFM-P激光器
12=HFM-Q激光器
13=HFM-J激光器
14=other

[Model_Explain]
0=CO2 简便模式
1=CO2 传统模式
2=调Q、普通电源+数字Q 传统模式
3=调Q、普通电源+模拟Q 传统模式
4=调Q、快速响应电源+数字Q 传统模式
5=调Q、快速响应电源+模拟Q 传统模式
6=调Q、普通电源+模拟Q 简便模式
7=调Q、快速响应电源+数字Q 简便模式
8=调Q、快速响应电源+模拟Q 简便模式
9=IPG 模式
10=SPI 简便模式
11=SPI 传统模式
12=LD 模式
13=YLPM(HFM-H) 传统模式
14=YLPM(HFM-H) 简便模式
15=YLP-V2 传统模式
16=YLP-V2 简便模式
17=YLPP 传统模式
18=YLPP 简便模式
19=HFM-A 传统模式
20=HFM-A 简便模式
21=HFM-P 传统模式
22=HFM-P 简便模式
23=HFM-R 传统模式
24=HFM-R 简便模式
25=HFM-J 传统模式
26=HFM-J 简便模式

[DIALOG_ScanType]
0=第三步: 设置振镜类型
1=自制振镜
2=其它振镜
3=提示:请正确选择机器对应的振镜类型, 自制振镜上电后需要预热才能正常工作,其它振镜无需预热
;---------------------------------End: Bin\LaserSetDll.dll-----------------------------------------

;---------------------------------BEGIN: Bin\CardApp\HLDown-----------------------------------------
[HLDOWN_DLG_2000]
CAPTION=文档下载管理
ID2000=IO有效位
ID1016=退出时切换成脱机模式
ID1013=IO属性
ID1014=下载
ID1015=开始/停止打标
ID1018=多文档保存
ID1=退出

[HLDOWN_DLG_2001]
CAPTION=设置IO
ID2001=获取当前信号
ID1=确定
ID2=取消

[HLDOWN_STRINGTABLE]
ID0=选择
ID1=文件名
ID2=IO有效位
ID3=IO托管值
ID4=下载标志
ID1000=请选择要下载文档!
ID1001=卡现有的文档将会被擦出,确认下载吗?
ID1002=下载失败,请重试!
ID1003=下载结果:
ID1004=下位机存储空间的 %d%% 已经被占用
ID1005=请选择要设置托管IO的文档!
ID1006=请选择要打标的文档!
ID1007=不能存在相同的托管值!
ID1008=已下载
ID1009=未下载
ID1010=开始打标
ID1011=停止打标
ID2000=成功下载
ID2001=文件传输失败
ID2002=文件太大，超过flash范围
ID2003=flash写入错误
ID2004=文档数据未准备好
ID2005=文档数据超出打标范围
ID2006=IO有效位未设定

;---------------------------------END: Bin\CardApp\HLDown-----------------------------------------

;---------------------------------BEGIN: Bin\HLIOCheck-----------------------------------------
[HLIOCHECK_DLG_3000]
CAPTION=IO信号检测
ID1012=输入
ID1013=输出
;---------------------------------END: Bin\HLIOCheck-----------------------------------------

;---------------------------------BEGIN: Bin\GraySet-----------------------------------------
[GRAYSET_DLG_1002]
CAPTION=灰度设置
ID1004=方案集
ID1842=另存为
ID1006=线性:
ID1403=删除
ID1005=控制模式:
ID1007=调整级数:
ID1838=白底
ID1001=复位
ID1008=打标测试
ID1837=全部灰度
ID1841=指定灰度
ID1009=灰度级:
ID1010=打标速度:
ID1011=点间距
ID1015=最小调节功率(%):
ID1016=最大调节功率(%):
ID1017=线性插值
ID1019=功率局部放大
ID1020=灰度局部放大
ID1024=最小:
ID1025=最大:
ID1=确定
ID2=取消

[GRAYSET_DLG_1003]
CAPTION=保存方案
ID1012=参数方案另存为:
ID1=确定
ID2=取消

[GRAYSET_STRINGTABLE]
ID1001=不能打开该方案!
ID1002=请选择要删除的方案
ID1003=缺省方案不能删除
ID1004=确认删除
ID1005=删除失败
ID1006=缺省方案不能被覆盖保存
ID1007=已经存在同名方案，确定覆盖?
ID1008=增加方案出错
ID1009=占空比
ID1010=Q调节
ID1011=电流
ID1012=直线
ID1013=曲线
ID1014=灰度级
ID1015=灰度色
ID1016=能量(%)
ID1017=IPG激光器暂不支持灰度调节!
ID1018=功率
ID1019=调频

;---------------------------------END: Bin\GraySet-----------------------------------------

;---------------------------------BEGIN: HANSADVINTERFACE-----------------------------------------
[HANSADVINTERFACE_STRINGTABLE]
ID00=成功
ID01=另一个程序在运行
ID02=路径不正确
ID03=初始化失败
ID04=未初始化
ID05=报警
ID06=命令超时
ID07=无法读取文件
ID08=指定的字体不存在
ID09=指定的层号不存在
ID10=没找到指定的对象
ID11=参数非法
ID12=错误的状态，当前状态下不能执行此操作
ID13=分配内存失败
ID14=打标范围超限
ID15=缓冲区不够
ID16=空指针
ID17=未找到指定文档
ID18=指定文档已经被打开
ID19=下位机命令执行失败
ID20=多文档数据下载失败
ID21=不能存相同的文档IO托管值
ID22=数据已下载
ID23=调用函数顺序不正确
ID24=生成线条失败
ID25=找不到校正文件，请先启动cali.exe进行校正
ID26=旋转切分停止
ID27=超出旋转打标范围
ID28=没有二次开发权限
ID29=授时加密狗已过期
ID30=脱机演示模式初始化成功（没有检测到控制卡）
ID100=未知错误

;---------------------------------END: HANSADVINTERFACE-----------------------------------------

;---------------------------------BEGIN: Bin\DoginfoReader-----------------------------------------
[DOGINFOREADER_DLG_102]
CAPTION=提取插入软件狗信息
ID1=退出
ID1002=提取
ID1003=导出数据
ID1004=清除

[DOGINFOREADER_STRINGTABLE]
ID102=成功
ID103=失败
ID104=提取信息操作开始........
ID105=软件狗操作异常
ID106=软件狗操作异常，时钟读取失败！
ID107=狗内部时钟：%.4d-%.2d-%.2d %.2d:%.2d:%.2d(%.4d-%.2d-%.2d %.2d:%.2d:%.2d)
ID108=提取信息操作结束....
ID109=软件狗版本
ID110=软件狗ID
ID111=写狗发布日期
ID112=功能(软件)类别
ID113=类别版本
ID114=控制卡类型
ID115=类别修订校验码
ID116=限制校验码
ID117=是否支持时间统计功能
ID118=是否起用时间统计功能
ID119=时间统计功能使能校验码
ID120=已用时间(秒)
ID121=名目
ID122=内容(右键点击名目, 进行选中名目相关联内容的拷贝)
ID123=加密狗相关信息导出失败，文件可能被占用！
ID124=加密狗相关信息成功导出到D:\\HansDogInfo.DAT中!!
ID125=加密狗有效期
ID126=永久解禁	

;---------------------------------End: Bin\DoginfoReader-----------------------------------------

;---------------------------------BEGIN: Bin\3DCALI-----------------------------------------
[3DCALI_DLG_4000]
CAPTION=3D校正
ID4004=后聚焦3D
ID4006=重置
ID4013=生成校正表
ID4014=开始打标
ID4015=红光预览
ID4016=循环打标
ID4018=校正类型
ID4019=基本参数
ID4020=测试
ID4021=电机基准位置
ID4022=最小调节位置
ID4023=最大调节位置
ID4024=电机位置
ID4025=电机递增量(0.01-5)
ID4026=基准面焦距

[3DCALI_STRINGTABLE]
ID4001=电机位置
ID4002=焦距
ID4003=开始打标
ID4004=停止
ID4005=确定生成新的校正表？
ID4006=校正前必须将[设置->校正参数设置]中聚焦方式设成'fθ后聚焦'。按'是'继续，按'否'退出修改聚焦类型
ID4007=校正完毕后，请将[设置->校正参数设置]中的聚焦方式改回'3D动态调焦’
;---------------------------------END: Bin\3DCALI-----------------------------------------


;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION=HL校正软件
ID1022=方案集
ID1023=请选择:
ID1007=另存为
ID1017=删除
ID1084=导入
ID1085=导出

ID1075=校正头
ID1024=基本参数
ID1025=校正范围(mm):
ID1026=打标范围(mm):
ID1072=坐标系
ID1077=旋转角度
ID1079=X偏移(mm)
ID1080=Y偏移(mm)
ID1119=振镜1=X
ID1120=振镜2=X
ID1116=反向
ID1117=反向

ID1030=网格及级别校正（选中缩放比例后双击可弹出自动计算窗口）
ID1009=添加级别
ID1010=删除级别
ID1012=多级整体效果
ID1031=回字级数:
ID1018=最大级别打标TEXT图形, 其他级别打标回字图形

ID1053=红光校正
ID1043=启用
ID1054=X缩放比:
ID1055=Y缩放比:
ID1056=X偏移量(mm):
ID1057=Y偏移量(mm):

ID1058=调焦
ID1065=聚焦方式
ID1059=动态调焦类型
ID1060=控制模式
ID1061=振镜轴间距(mm)
ID1082=方头到工作平面高度(mm)
ID1063=微调值(um)
ID1062=动态调焦补偿系数

ID1011=测试 F7
ID1037=停止
ID1014=参数>>

ID1109=校正类型
ID1099=普通校正
ID1100=高精度校正1[扫描仪]
ID1101=高精度校正[导入真实坐标数据]
ID1110=高精度校正说明：1、首先选择普通校正进行常规的校正，对坐标系、红光校正、BOX大小及变形进行初步调整。2、选择高精度校正，生成网格点。3、用不同的工具获得数据并进行处理后，将数据导入。
ID1114=直接导入高精度校正数据

ID1089=高精度校正
ID1086=生成网格点
ID1111=第一步:生成网格点。
ID1112=第二步:导入扫描仪或者二次元测量出的真实坐标数据。
ID1113=第三步:创建高精度校正表并确认保存退出。

ID1096=缩放
ID1027=高精度打标范围(mm)
ID1097=凹凸
ID1028=测试BOX大小(mm):
ID1091=导入扫描仪处理后数据
ID1087=导入数据
ID1016=创建高精度校正表
ID1=确定
ID2=取消
ID1142=打标控制

[CALISET_DLG_167]
CAPTION=高精度数据导入
ID1114=二次元获取的X坐标文件：
ID1115=二次元获取的Y坐标文件：
ID1=确定
ID2=取消

[CALISET_DLG_159]
CAPTION=保存方案
ID1036=校正方案另存为:
ID1=确定
ID2=取消

[CALISET_DLG_131]
CAPTION=打标参数
ID1032=打标次数:
ID1033=打标速度(mm/s)
ID1035=功率(%)
ID1034=Q频(KHz)
ID1036=Q释放时间(us)
ID1037=激光关延时(us)
ID1139=生成校正表
ID1=确定
ID2=取消

[CALISET_DLG_160]
CAPTION=设置点阵打标行列信息
ID1093=行数
ID1094=列数
ID1116=仅设置行列数,不打标
ID1=打标
ID2=取消

[CALISET_DLG_164]
CAPTION=选择控制卡
ID1098=请选择工作卡：
ID1=确定
ID2=取消

[CALISET_STRINGTABLE]
ID0=BOX大小(mm)
ID1=X缩放比例％
ID2=Y缩放比例％
ID3=X凹凸
ID4=Y凹凸
ID5=X梯形
ID6=Y梯形
ID7=X平行
ID8=Y平行
ID9=X正向比例％
ID10=X负向比例％
ID11=Y正向比例％
ID12=Y负向比例％
ID13=参数\级别
ID14=电流(A)
ID15=功率(%)
ID16=电流(%)
ID17=激光脉宽(ns)
ID18=激光模式
ID999=已经有打标软件或校正软件正在运行,请先关闭!
ID1000=打标库文件丢失或损坏，请确认软件是否正常!
ID1001=打标控制卡初始化失败!
ID1002=打标控制卡系统设置失败!
ID1003=请先选择要测试的校正级别!
ID1004=操作失败，请稍后再试!
ID1005=已存在该方案名，覆盖吗?	
ID1006=校正范围不能为0!	
ID1007=打标范围不能为0!
ID1008=校正范围和打标范围的比例系数不对，校正范围必须是打标范围的%.3f倍上!
ID1011=请选择要删除级别
ID1012=请至少保留一级校正!
ID1013=文件错误!
ID1014=设定校正数据到卡失败，请稍后重试!	
ID1015=该校正配置方案与当前软件版本不一致，是否强制读入吗?
ID1016=BOX大小不能超出打标范围!
ID1017=BOX大小不能超出上一级大小!
ID1018=当前校正设置已经修改，保存吗?
ID1019=读取文件失败!
ID1020=确认删除当前方案吗?
ID1021=没有检测到软件狗!
ID1022=检测到软件狗，但不是合法的软件狗!
ID1023=插入的合法软件狗多于1个!
ID1024=将初始狗转换成运行狗失败!
ID1025="当前软件授权已到期，需要联系大族客服人员，重新申请与（狗ID=%s，校验码=%s）匹配的许可授权补丁，以便继续使用"
ID1026="D160"
ID1027="D480"
ID1028="CO2增强"
ID1029="CO2传统"
ID1030="打标失败"
ID1031=BOX大小不能小于下一级大小!
ID1032=超出有效校正区域
ID1033="fθ后聚焦"
ID1034="3D动态调焦"
ID1035="普通后聚焦"
ID1036="简便激光器控制模式下BOX大小必须小于打标范围%dmm"
ID1037="获取卡内保存的狗ID失败,请检查卡是否被绑定过"
ID1038="导入失败"
ID1039="导入成功"
ID1040="导出失败"
ID1041="导出成功"
ID1042="操作失败"
ID1043="文件数据不匹配"
ID1044="后聚焦3D"
ID1045="X坐标文件路径为空!"
ID1046="Y坐标文件路径为空!"
ID1047="卡上的狗号跟加密狗狗号不一致"
ID1048="卡上的卡号为空或长度不对"

;---------------------------------End: EMCC\Caliset-----------------------------------------

[IDD_DIALOG_TESTFOCUS]
CAPTION=微焦定位
1=应用（＆a）
2=退出（＆c）
1502=
1911=
1013=打标（＆m）
1014=停止（＆S）
2189=步骤1：设置焦点调整金额并标记
2190=步骤2：找到最有效的一个，然后将数字输入编辑框中
2191=精细调整金额
2193=最佳标记效果编号：

[IDD_MARK_WHEEL2]
CAPTION=动态运动打标
1870=打标统计
1475=
1265=0:00:00:00
1263=0
1266=0:00:00:00
1264=0:00:00:00
1267=0:00:00:00
1492=打标
1634=红光预览
1012=
1396=刷新
1794=
1724=红光
1013=开始（＆m）
1014=停止（＆e）
2=退出（＆x）
1740=循环打标
1502=
1034=
1803=
1804=
1869=打标结束后的家
1903=电机复位
2422=打标总数：
1475=
2423=总时间：
1413=打标个数：
1263=
2436=空闲时间：
2405=单个时间：
1414=打标时间：
1267=0:00:00:00
2444=打标类型

[IDD_MARK_DIALOG_COMBOBOX_0]
0=整体边框预览
1=对象边框预览
2=轮廓预览

[IDD_TEXTEDIT_DLG_COMBOBOX_0]
0=普通文本
1=跳号
2=日期时间
3=串口文本
4=网络文本

[IDD_TEXTEDIT_DLG_COMBOBOX_1]
0=TTF字体
1=SHX字体
2=自定义字体
3=点阵字体
4=Fnt字体

[IDD_DIALOG_3DLOAD_COMBOBOX_0]
0=阶梯
1=斜面
2=圆柱
3=球
4=圆锥

[IDD_DIALOG_BAREDIT_COMBOBOX_1]
0=普通文本
1=跳号
2=日期时间
3=串口文本
4=网络文本

[IDD_DIALOG_OBJINFO_CCD_COMBOBOX_0]
0=继续
1=退出

[IDD_BAR_PAGE_COMBOBOX_0]
0=MAC - 罗马
1=MAC - 日语
2=MAC - 繁体中文 Big5
3=MAC - 朝鲜语
4=MAC - 阿拉伯语
5=MAC - 希伯来语
6=MAC - 希腊语 I
7=MAC - 西里尔文
8=MAC - 简体中文 GB 2312
9=MAC - 罗马尼亚
10=MAC - 乌克兰
11=MAC - 泰语
12=MAC - 拉丁语 II
13=MAC - 冰岛文
14=MAC - 土耳其语
15=MAC - 克罗地亚
16=IBM EBCDIC - 土耳其语(拉丁语-5
17=IBM EBCDIC - 拉丁语/开放系统
18=IBM EBCDIC - 美国/加拿大(37 + Euro
19=IBM EBCDIC - 德国(20273 + Euro
20=IBM EBCDIC - 丹麦/挪威(20277 + Euro
21=IBM EBCDIC - 芬兰/瑞典(20278 + Euro
22=IBM EBCDIC - 意大利(20280 + Euro
23=IBM EBCDIC - 拉丁美洲/西班牙(20284 + Euro
24=IBM EBCDIC - 英国 (20285 + Euro
25=IBM EBCDIC - 国际(500 + Euro
26=IBM EBCDIC - 冰岛语(20871 + Euro
27=ANSI - 中欧
28=ANSI - 西里尔文
29=ANSI - 拉丁语 I
30=ANSI - 希腊语
31=ANSI - 土耳其语
32=ANSI - 希伯来语
33=ANSI - 阿拉伯语
34=ANSI - 波罗的海
35=ANSI/OEM - 越南
36=朝鲜语 - Johab
37=CNS - 台湾
38=TCA - 台湾
39=Eten - 台湾
40=IBM5550 - 台湾
41=TeleText - 台湾
42=Wang - 台湾
43=IA5 IRV 国际字母表 5
44=IA5 德语
45=IA5 瑞典语
46=IA5 挪威语
47=US-ASCII
48=T.61
49=ISO 6937 无空格重音符
50=IBM EBCDIC - 德国
51=IBM EBCDIC - 丹麦/挪威
52=IBM EBCDIC - 芬兰/瑞典
53=IBM EBCDIC - 意大利
54=IBM EBCDIC - 拉丁美洲/西班牙
55=IBM EBCDIC - 英国
56=IBM EBCDIC - 扩展式日语片假名
57=IBM EBCDIC - 法国
58=IBM EBCDIC - 阿拉伯语
59=IBM EBCDIC - 希腊语
60=IBM EBCDIC - 希伯来语
61=IBM EBCDIC - 扩展式朝鲜语
62=IBM EBCDIC - 泰语
63=俄语 - KOI8
64=IBM EBCDIC - 冰岛语
65=IBM EBCDIC - 西里尔文(俄语
66=IBM EBCDIC - 土耳其语
67=IBM EBCDIC - 拉丁语/开放系统(1047 + Euro
68=JIS X 0208-1990  0212-1990
69=简体中文 GB2312
70=IBM EBCDIC - 西里尔文(塞尔维亚语、保加利亚语
71=Ext Alpha 小写
72=乌克兰语 - KOI8-U
73=ISO 8859-1 拉丁语 I
74=ISO 8859-2 中欧
75=ISO 8859-3 拉丁语 3
76=ISO 8859-4 波罗的语
77=ISO 8859-5 西里尔文
78=ISO 8859-6 阿拉伯语
79=ISO 8859-7 希腊语
80=ISO 8859-8 希伯来语: 视觉排序
81=ISO 8859-9 拉丁语 5
82=ISO 8859-13 拉丁语 7
83=ISO 8859-15 拉丁语 9
84=IBM EBCDIC - 美国/加拿大
85=ISO 8859-8 希伯来语: 逻辑排序
86=OEM - 美国
87=IBM EBCDIC - 国际
88=ISO-2022 不带半形片假名的日语
89=ISO-2022 带半形片假名的日语
90=ISO-2022 日语 JIS X 0201-1989
91=ISO-2022 朝鲜语
92=ISO-2022 简体中文
93=ISO-2022 繁体中文
94=EUC-朝鲜语
95=HZ-GB2312 简体中文
96=GB18030 简体中文
97=SMS GSM 7bit
98=SMS GSM 7bit 西班牙语
99=SMS GSM 7bit 葡萄牙语
100=SMS GSM 7bit 土耳其语
101=SMS GSM 7bit 希腊语
102=ISCII - 梵文
103=ISCII - 孟加拉语
104=ISCII - 泰米尔语
105=ISCII - 泰卢固语
106=ISCII - 阿萨姆语
107=ISCII - 奥里亚语
108=ISCII - 埃纳德语
109=ISCII - 马拉雅拉姆语
110=ISCII - 古吉拉特语
111=ISCII - 旁遮普语(果鲁穆奇语
112=阿拉伯语 - ASMO
113=阿拉伯语 - 透明 ASMO
114=OEM - 希腊语 437G
115=OEM - 波罗的语
116=OEM - 多语言拉丁语 I
117=OEM - 拉丁语 II
118=OEM - 西里尔文
119=OEM - 土耳其语
120=OEM - 多语言拉丁语 I + Euro
121=OEM - 葡萄牙语
122=OEM - 冰岛语
123=OEM - 希伯来语
124=OEM - 加拿大法语
125=OEM - 阿拉伯语
126=OEM - 挪威语
127=OEM - 俄语
128=OEM - 现代希腊语
129=IBM EBCDIC - 多语言/ROECE (拉丁语-2
130=ANSI/OEM - 泰语
131=IBM EBCDIC - 现代希腊语
132=ANSI/OEM - 日语 Shift-JIS
133=ANSI/OEM - 简体中文 GBK
134=ANSI/OEM - 朝鲜语
135=ANSI/OEM - 繁体中文 Big5
136=UTF-7
137=UTF-8

[IDD_BAR_PAGE_COMBOBOX_1]
0=逐点，从内到外
1=逐点，从外到内
2=所有点，从内到外
3=所有点，从外到内

[IDD_TEXT_PAGE_FNT_COMBOBOX_6]
0=TTF字体
1=SHX字体
2=用户字体
3=矩阵字体
4=fnt字体

;STRINGTABLE 模块
[STRINGTABLE]
241 = 导入EZD文档失败
240 = 全部边角三角形
239 = 全部边角圆形
238 = 倒角程度 ( mm )
237 = 倒圆程度 ( 0 ~ 100 )
236 = 矩形
235 = Lmc1_Initial 初始化失败
234 = 加载MarkEzdDll.dll失败
233 = 选择None需要重启软件后才能生效！
232 = 你确实要删除该快捷键吗？
230 = 红光(F1)
231 = 停止红光(F1)
229 = 没有找到%s文件
228 = 功能
227 = 快捷键
223 = 长度：
226 = 角度:
32779=初始化打标机，使之进入通用打标状态|通用平面打标
57642=|选取全部对象
57643=撤消最后一步操作|撤消
57644=重新执行先前已撤消的操作|重新执行
57648=为活动文档打开另一个窗口|新建窗口
57649=将图标排列在窗口底部|排列图标
57650=排列窗口成相互重叠|层叠窗口
57651=排列窗口成互不重叠|平铺窗口
57652=排列窗口成互不重叠|平铺窗口
57653=将活动的窗口分隔成窗格|分隔
57664=显示程序信息，版本号和版权|关于
57665=退出应用程序；提示保存文档|退出
57666=打开帮助|帮助主题
57667=列出帮助主题|帮助主题
57668=显示关于如何使用帮助的指令|帮助
57669=显示对按钮、菜单和窗口执行单击操作的帮助|帮助
57670=显示对当前任务或命令的帮助|帮助
57680=切换到下一个窗格|下一窗格
57681=切换回前一个窗格|前一窗格
59392=显示或隐藏常用工具栏|显隐常用栏
59393=显示或隐藏状态栏|显隐状态栏
59415=点
61184=改变窗口大小
61185=改变窗口位置
61186=将窗口缩小成图标
61187=把窗口放大到最大尺寸
61188=切换到下一个文档窗口
61189=切换到先前的文档窗口
61190=关闭活动的窗口并提示保存所有文档
61202=把窗口恢复到正常大小
61203=激活任务表
61215=激活该窗口
61445=关闭打印预览模式|取消预阅
61449=没有选中可编辑的点！
61450=框选区域有重点!
61451=只允许选中一个点!
61452=该曲线为非闭环曲线！
61453=两点之间的距离小于最小距离精度，不能连接！
61454=文档滤点命令
61455=缩扩边命令
61456=是否把刚才的排序应用到对象中?
61458=是否确定要退出排序处理?
61459=是否指定自动排序起点？
61460=缺少排序引导线！
61461=对象合成
61462=选组
61463=对象对齐
61464=排序对象小于6个不能进行排序！
61465=通用
61466=高级
61472=号
61473=层
61474=边框
61475=填充
61476=先填
61477=当前正在脱机，是否重新下载？
61478=当前为脱机打标，是否切换为联机状态？
61479=开始
61480=中止
61481=是否清除控制卡中的脱机数据？
61482=速度
61483=Q频
61484=Q释放
61485=现在将关闭当前打标软件启动校正程序,是否继续?
61486=现在将关闭当前打标软件启动激光器参数设置程序,是否继续?
61487=确定对选定的曲线进行'曲线合并'操作?
61488=绝对坐标
61489=相对坐标
61490=是否进行快速排序?
61491=是否将排序恢复为默认值?
61492=现在将关闭当前打标软件启动M值调节软件，是否继续?
61493=当前文档成功下载到卡, 存储空间占用 %d%% ,可以进行脱机打标!
61494=软件被破坏, 文件不正确!
61495=普通文本
61496=跳号
61497=日期时间
61498=TTF字体
61499=SHX字体
61500=自定义字体
61501=样条曲线
61502=曲线是否闭合?
61503=圆弧
61504=圆
61505=数据非法，请检查输入!
61506=起始值和结束值与步长不匹配，请重新输入!
61507=圆弧对象
61508=圆对象
61509=快速排序命令
61510=中止(&E)
61511=点阵字体
61512=群组
61513=运动控制   
61514=位置设定   
61515=系统没有找到当前卡对应的校正文件，请先校正BOX再运行软件!
61516=当前操作会根据设置的圆周直径对现有数据进行重新组合排序，|可能会改变当前数据形态, 确定是否继续?
61517=自动切分
61518=友情提示:|系统检测到当前打标数据中部分对象长度过大,|如果要取得较好的圆周打标效果，建议使用切分标记模式!
61519=打标数据中存在功能组件对象，当前操作被禁止!
61520=用户名
61521=类型
61522=灰度
61523=个数
61524=标尺设定操作会对现有数据进行重组，是否继续?
61525=对象
61526=间隔数
61527=显示数字
61528=小数位数
61529=优先级
61530=群组
61531=取消群组
61532=修改图层
61533=没有连接卡
61534=软件狗没有一机多卡功能!
61535=软件狗ID跟卡上的狗ID不一致
61536=卡上的卡ID为空或者长度不对
61537=请登陆微信公众号"大族激光光纤打标"->"员工通道"->"更多服务"->"授权文件管理中心"->"加密文件申请"，按提示下载License文件。
61538=将成功下载的License文件拷贝到%%s目录下。
61539=备注：申请失败，请联系大族售后服务人员。
61540=是否打开DogInfoRead.exe查看加密狗信息?
61541=填充失败! 含有未闭合的曲线!
61542=填充失败! 含有冗余小线段
61543=正在执行快速打标, 应用失败!
61544=正在执行红光预览, 应用失败!
61545=正在执行对象打标, 应用失败!
61546=Fnt字体
61547=没有打标对象！
61548=逐点，从内到外
61549=逐点，从外到内
61550=所有点，从内到外
61551=所有点，从外到内
61552=该对象无法填充。
61553=该条码对象已应用自动填充，无法使用外部填充。
61554=对象操作
61555=位置
61556=角度
61557=镜像
61558=尺寸
61559=切变
61560=中心
61561=mm
61562=比例
61563=°
61564=绘制其他图形
61565=3D绘制
61567=当前加工数已大于加工总数，请复位当前加工数后再加工！
33148=3D/2D切换|3D/2D切换
33149=装载3D模型|装载3D模型
33150=变换3D模型|变换3D模型
33151=编辑选中节点坐标|编辑选中节点坐标
33154=导入矢量文件|导入矢量文件
33155=导入位图文件|导入位图文件
33156=导入数控加工文件|导入数控加工文件
33157=切换至XY视图|切换至XY视图
33158=切换至YZ视图|切换至YZ视图
33159=切换至XZ视图|切换至XZ视图
33160=切换至轴侧图|切换至轴侧图
33162=微焦定位|微焦定位
33163=旋转打标参数设置|旋转打标参数设置
33165=运动参数设置|运动参数设置
33178=焊接造型|焊接
33182=交点过滤|去除交叉点
33184=捕获对象端点|铺助对象
33189=创建激光控制对象 | 激光控制对象 
33198=CCD对象|创建CCD对象
33200=位置校正|创建位置校正对象
33202=模型移动|模型移动
33205=线条加粗|线条加粗
33211=初始化打标机，使之进入动态动运打标状态|动态运动打标
33220=无损圆周打标，文本切分|无损圆周打标，文本切分
33224=测量距离|测量距离
33225=测量角度|测量角度
33226=相交|交叉
33227=修剪|修剪
33228=移除|移除
33245=按图层排序|按图层排序
33246=对象自动排序2|对象自动排序2
33247=选中模型居中|选中模型居中
33256=设置飞行参数
33264=|反转选取对象
33266=|锁定对象
33267=|解锁对象
33268=|解锁全部对象
33270=|按笔号选择对象
33273=|显示
33274=|隐藏
33275=|对象操作
33399=|对象变换
33413=转为摆动线|转为摆动线
33415=矢量转为位图|转为位图
57344=HL
57345=         
57346=选定一个要得到帮助的对象
57347=%1 在 %2 中
57349=%1 - %2
57600=建立新文档|新建
57601=打开一个现有文档|打开
57602=关闭活动文档|关闭
57603=保存活动文档|保存
57604=将活动文档以一个新文件名保存|另存为
57605=改变打印选项|页面设置
57606=改变打印机及打印选项|打印设置
57607=打印活动文档|打印
57609=显示整页|打印预览
57616=打开该文档
57617=打开该文档
57618=打开该文档
57619=打开该文档
57620=打开该文档
57621=打开该文档
57622=打开该文档
57623=打开该文档
57624=打开该文档
57625=打开该文档
57626=打开该文档
57627=打开该文档
57628=打开该文档
57629=打开该文档
57630=打开该文档
57631=打开该文档
57632=删除被选对象|删除
57633=全部删除|全部删除
57634=复制被选对象并将其置于剪贴板上|复制
57635=剪切被选对象并将其置于剪贴板上|剪切
57636=查找指定的正文|查找
57637=插入剪贴板内容|粘贴
57640=重复上一步操作|重复
57641=用不同的正文替换指定的正文|替换
33005=拖动视图|拖动视图
33006=局部放大|局部放大
33007=节点编辑|节点编辑
33008=显示左侧列表对话框|显示左侧列表对话框
33009=显示属性对话框|显示属性对话框
33010=精确移动|精确移动
33011=转为曲线|转为曲线
33014=删除选中节点|删除选中节点
33015=线条首尾连接|线条首尾连接
33016=精确移动|精确移动
33017=断点操作|断点操作   
33018=断点操作|断点操作
33029=对象手动排序|对象手动排序
33030=对象自动排序|对象自动排序
33039=对象走势排序|对象走势排序
33040=把打标对象合成一个对象|对象合成
33044=等宽|等宽
33045=等高|等高
33046=等大小|等大小
33047=左对齐|左对齐
33048=右对齐|右对齐
33049=上对齐|上对齐
33050=下对齐|下对齐
33051=横向等间距|横向等间距
33052=纵向等间距|纵向等间距
33053=快捷键定义设置|快捷键定义设置
33061=IO选择多文档处理过程|联机IO选文档
33062=红光预览处理过程|红光预览
33063=进入简捷打标界面，打标完成后退出|快速打标
33064=复制双头属性|复制双头属性
33065=粘贴双头属性|粘贴双头属性
33068=对象选择排序|对象选择排序
33069=横向中心对齐|横向中心对齐
33070=纵向中心对齐|纵向中心对齐
33072=单文档脱机下载处理|单文档脱机下载
33073=擦除已下载脱机数据|擦除脱机数据
33074=IO信号检测
33076=将头尾相距很近的曲线合并成一条曲线|相邻曲线合并
33079=分区域快速排序|快速排序
33086=初始化打标机，使之进入IO信号选择文档下载|IO选文档脱机下载
33092=创建延时对象|延时器
33093=创建等待输入信号对象|等待信号输入
33094=创建输出信号对象|输出信号
33097=在样条曲线绘制模式下画样条曲线|样条曲线绘制工具
33113=通过确定圆弧上三点绘制圆弧|绘制圆弧
33115=通过确定圆心和圆弧上两点绘制圆弧|绘制圆弧
33117=通过半径和圆心绘制圆|绘圆工具
33129=画点|点工具
33131=将选定对象组成一个群组|对象群组
33132=取消选定对象的群组属性|取消群组
33136=根据工件直径,对当前数据进行数据重组 |数据重组 
33137=初始化打标机，使之进入旋转打标状态|旋转打标
33138=创建运动对象 | 电机运动 
33139=设置当前电机位置 | 设置当前位置 
33141=创建条件判断对象 | 条件判断 
33142=刻度尺编辑向导|创建刻度尺
33143=对象重命名|对象重命名
32783=预览打标处理过程|预览
32784=请输入新序号:
32785=请输入对方序号:
32788=完成校正过程|校正
32791=删除选中的对象|删除选中对象
32793=请选择对象！
32794=请先复制对象双头属性！
32795=生成成功！
32796=选中%d个排序对象;|排序路径上的排序对象数为:%d个;|是否进行排序？
32804=缩小绘图|缩小
32805=放大绘图|放大
32807=放大绘图中所有对象|缩放全部对象
32808=只放大选定的对象|缩放选定对象
32809=显示全部可打标页|缩放到全部页面
32813=画矩形|矩形工具
32814=画椭圆和圆|椭圆工具
32815=绘制对称多边形|多边形工具
32816=画一组矩形|网格工具
32820=填充对象|填充工具
32821=选择对象，变形对象|挑选工具
32828=组合选定的对象|组合对象
32829=取消选定对象组合|取消组合
32832=设置选项参数|选项
32839=设置打标范围及相关参数|打标范围
32841=打标机系统设置设定|系统设置
32842=打标机硬件配置设定|触发信号
32844=变换位置|位置
32845=变换角度|旋转
32846=变换比例和镜象|缩放
32847=变换大小|大小
32901=使被选对象处于页面中心|居中
32907=使被选对象左右镜像|左右镜像
32908=使被选对象上下镜像|上下镜像
32913=使被选对象左旋90度|左旋90度
32914=使被选对象右旋90度|右旋90度
32916=设置跟踪器属性|设置跟踪器
32917=显示或隐藏层设置栏|显隐层设置栏
32919=创建条形码|条码工具
32920=导入模版
32921=导出模版
32938=设置相对中心点座标|相对中心
32939=设置飞行打标参数|飞行打标
32940=将指定的对象进行阵列排布|阵列
32943=使用传统方式设置打标范围|打标范围
32944=没有找到字库！
32949=将选定的多个对象对齐边界|对齐
32951=初始化打标机，使之进入多文档打标状态|多文档打标
32953=打开多个现有文档|多文档
32954=位图打标属性|位图
32956=显示总的打标时间和次数|显示打标统计数据
32957=名称
32958=类型
32959=序号
32964=非比例缩放|非比例缩放
32965=未知
32966=曲线
32967=矩形
32968=文本
32969=跳号
32970=椭圆
32971=网格
32972=多边形
32973=条码
32974=组合
32976=延时器
32977=输入信号
32978=输出信号
32979=传输当前文档|传输当前文档
32980=传输所有文档|传输所有文档
32981=设置底层打标参数|设置底层打标参数
32982=条件开始
32983=条件结束
32995=创建二维条形码|二维条码工具
32997=创建二维条形码|二维条码工具
32998=创建与条码关联文本|条码文本
33001=完成灰度电流补偿|补偿
33002=对位图灰度进行非线性补偿
214=没有选中任何项！
215=当前控制卡版本过低！
216=控制卡初始化失败，系统即将退出！
217=Device库版本不对，系统即将退出！
218=该文档存在跳号对象，不能重复关联！
219=参数非法！
220=不支持的文件类型！
306=导入图形文件|导入
307=在手绘模式下画线条和曲线|手绘工具
308=设置文本及跳号|文本及跳号
309=     
310=     
311=选中对象中包含条码或文本，是否转化为普通曲线？
312=已经达到256条测量线，无法再增加！
313=没有找到信号匹配的文档
566=8位字节
567=日本汉字
568=中国汉字
1700=已缩小到最小值，此次操作将取消!
1701=打开灰度电流补偿文件失败!|使用默认参数
1702=保存灰度电流补偿文件失败!
1703=不能找到:
1704=建立导入文件夹失败，|请检查磁盘是否为只读
1705=导入文件夹已有文件:
1706=，|原文件:
1707=|替换或自动重命名?
1708=默认用户不存在！请输入用户名与密码登录。
1709=用户信息被损坏或不存在；按[确定]启用超级用户登录，按[取消]退出程序。
1710=用户信息被损坏或不存在！
2070=外凸面
2071=内凹面
29141=当前用户:
29142=当前位置:
29143=矢量总长:
29144=用户已经存在！
29145=用户名或密码不正确！
29146=非管理员用户，不能进行此项操作！
29147=密码不能为空！
29148=密码不正确！
29149=用户名不能为空！
29150=用户不存在!
29151=原始密码不正确！
29153=对象列表
29154=特性列表
29155=设置
29156=填充编辑
29157=双头
29158=对象排序
31460=增加参数方案时出错！
31461=请选择要删除的参数方案
31462=不能更改成所选的参数方案！
31463=不能删除所选的参数方案
31464=当前参数集将被存为默认值，下次打开一个新文档时，|打标参数将会设置成这些值。确认吗？
31465=设为默认值时出错！
31466=请输入正确的方案名！
31467=已存在该方案名，覆盖吗？
31468=外部文件导入
31469=不可预知的文件的格式或读取文件失败！
31470=没有正在绘制的对象！
31479=开始(&M)
31480=暂停
31482=定时器定义错误！
31484=OLE初始化失败，请确保OLE库是正确的版本！
31485=绘图
31487=变换
31488=常用
31489=点击中心点放大或框选范围放大
31490=点击中心点缩小
98=大族激光标记控制软件V4.0.1
99=|BS|BS|BS 文件 (*.bs)|.bs|BS.Document|BS Document
100=激光控制
101=HANS Edit Software
102=|BS|BS|BS 文件 (*.bs)|.bs|BS.Document|BS Document
103=CCD
104=位置校正
105=校正集:      
106=显示或隐藏属性栏|显隐属性栏
107=请先选择对象
108=拖动命令
109=添加新结点
110=结点编辑命令
111=删除节点命令
112=选择多个对象命令
113=选中了另一个对象
114=储存当前文档
115=显示与隐藏工具条|显示与隐藏工具条
116=对象属性
117=打标参数
118=是否转化为普通曲线?
119=加载动态库失败！
120=功能描述
121=激活状态
122=灰度位图打标
123=运动控制及旋转打标
124=高精度校正
125=一机多卡切换
126=已激活
127=未激活
128=现在将关闭当前打标软件启动通讯打标软件，是否继续?
129=NG后继续
130=显示或隐藏变换工具栏|显隐变换栏
131=显示或隐藏绘图工具栏|显隐绘图栏
132=显示或隐藏缩放工具栏|显隐缩放栏
133=注意：跳号已经跳到设定目标值！
134=功能序号
135=控制卡切换失败，请关闭软件重新起动！
136=控制卡切换成功，可以在新卡上进行操作！
137=一个软件狗和多块卡进行了绑定，请重新绑定或只保留一块卡!   
138=阶梯
139=斜面
140=圆柱
141=球
142=圆锥
143=坐标
144=长度
145=宽度
146=3D打标
147=下位机程序版本过低，请先下载支持3D打标的版本！
148=打标时间:
149=正限位
150=电机位置:   
151=负限位
152=焦点定位测试文件中文本名称与排列顺序不匹配，请先按数字顺序排序后重试！
153=焦点定位测试文件中对象数不是20个，请检查测试文件是否正确！
154=旋转轴
155=平移轴
156=语言选项修改要重启软件才能生效, 请关闭打标软件重新启动!
158=数字
159=混合字符
160=NG后退出
161=混合编码
162=设置动态打标范围失败
163=设置脉冲和反馈脉冲失败
164=软件检测到当前操作系统为Win7或以上版本，|首次起动软件必须以管理员权限运行! 
165=本机操作系统为Win7及以上，软件没有以管理员权限运行时，必须给软件目录赋读写权限，否则可能运行不正常!
166=注销后，用户需要重新登陆，是否注销?
167=螺旋线
168=AI
169=PDF
170=DST
171=3D MODEL
172=3D FRAME
173=大幅面功率校正软件
174=二次开发接口库
175=选中卡开始
176=选中卡暂停
177=没有正在绘制的对象！
178=焊接
179=修剪
180=相交
181=移除
182=串口文本
183=网络文本
184=通讯连接创建错误：连接数量已达最大值！
185=通讯TCP连接错误：创建失败！
186=通讯TCP连接错误：连接失败！
187=通讯串口连接错误：创建失败！
188=通讯文本刷新错误：串口发送失败，串口未连接、数据为空或发送超时！
189=通讯文本刷新错误：串口连接已不存在！
190=通讯文本刷新错误：串口读取失败，串口未连接或接收超时！
191=通讯文本刷新错误：串口接收到的内容为空！
192=通讯文本刷新错误：TCP发送失败！
193=通讯文本刷新错误：TCP连接已不存在！
194=通讯文本刷新错误：TCP接收超时！
195=获取加密狗功能模块失败！
196=找不到指定的控制卡，请单独打开其关联的.hs文档进行操作！卡号：
197=找不到FdichU.dll或版本不对！
198=加密狗已移除，请插入加密狗！
199=该矢量文件过大！
200=内存不足，复制/粘贴失败！
201=加载用户字体库/功能函数失败！
202=找不到字体：
203=激光器输入未准备就绪！
204=创建3D模型失败！
205=模式错误，请重设工作模式！
206=运动参数错误！
207=设置电机延时失败！
208=文本替换失败！
209=打开串口失败！
210=创建位图文件夹失败！
211=dst文件大小错误！
212=找不到该dst文件的'LA'标志！
213=找不到该dst文件的结束标志！
31491=缩放
31492=椭圆  宽度:%.3f 高度:%.3f (毫米)
31493=矩形 宽度:%.3f 高度:%.3f (毫米)
31494=直线 DX:%.3f(毫米) DY:%.3f(毫米) 距离:%.3f(毫米) 角度:%.3f(度)
31495=曲线 开始(%.3f,%.3f) 结束(%.3f,%.3f) (毫米,毫米)
31496=移动 X方向:%.3f Y方向:%.3f (毫米)
31497=缩放 比例:%.1f%%
31498=缩放 X方向比例:%.1f%%
31499=缩放 Y方向比例:%.1f%%
31500=重做
31501=撤消
31502=移动
31503=创建
31504=缩放
31505=拉变
31506=拾取
31507=删除
31508=旋转
31509=选择对象
31510=复制
31511=组合
31512=取消组合
31513=粘帖
31515=网格 宽度:%.3f 高度:%.3f (毫米)
31517=填充
31519=多边形 宽度:%.3f 高度:%.3f (毫米)
31520=SHX跳号
31521=属性
31522=层设置
31523=没有选定的层！
31524=不能删除图层0！
31525=没有激活的文档！
31526=该图层 将被删除，文档中对应的图形将移至图层0
31527=你没有选择图层，要再试一次吗？
31528=层属性
31529=条码设置
31530=对象属性
31551=打开位置文件
31552=保存位置文件
31553=阵列
31554=文本及跳号
31555=字体及字形
31556=排布方式
31586=请先对所有文档进行存贮后，再进入多文档打标中重试!
31587=保存多文档设置
31588=装入多文档设置
31589=保存多卡文档设置
31590=请先对所有文档进行存贮后，再进入多卡打标中重试!
31591=装入多卡文档设置
31592=%4d年%2d月%2d日
31593=%D天%H小时%M分钟%S秒
31599=密码错误，你需要重新进行密码验证，否则你只能对“硬件设置”进行查看。|选择“YES”查看“硬件设置”，选择“NO”退回重新验证密码。
31600=错误
31601=新密码两次输入不相同
31602=原始密码不正确，无权修改密码
31616=超出系统打标范围
31617=请输入文件名
31618=密码不对，请重新输入。注意：您共有三次机会
31619=密码必须为20字符长度之内的任意数字或英文字母！
31620=联接数据错误！
31649=已有一份实例在运行!
31650=请选中操作目标项
31652=打开文件出错！
31658=颜色
31660=对不起！ 您没有该权限！
31698=点阵字库打开失败!
31709=您输入了不存在的的层号！
31718=条码
31719=文本
31720=字体
31721=排布
31724=管理员
31725=普通
31726=导出PLT错误！
31727=bind.set
32782=设置控制卡的详细参数|控制卡
33003=导出PLT文件
33004=打开帮助文件
157=此文件格式非法，无法识别!
16001=应选择一个图像!
16002=应输入文本!
16003=无法创建新图像!
16004=无法从剪贴板粘贴位图图像!
16005=只能粘贴大小为(%d x %d)的位图!
16006=菜单栏
16007=无法自定义菜单!
16008=工具栏内部错误。 请与应用程序供应商联系。
16009=[未分配]
16010=无法将位图图像复制到剪贴板!
16011=隐藏停靠窗口
16012=扩展停靠窗口
16013=收缩停靠窗口
16014=新建菜单
16015=文件
16016=文件夹
16017=新建
16018=现有
16019=最近
16020=删除
16021=上移项
16022=下移项
16023=可执行文件(*.exe)|*.exe|命令(*.com)|*.com|信息(*.pdf)|*.pdf|批处理(*.bat)|*.bat|所有文件(*.*)|*.*||
16024=最多可以定义 %d 个工具。
16025=扩展(%s)
16026=更多按钮
16027=新建
16028=通过拖动可使此菜单浮动
16029=命令
16030=键
16031=说明
16032=关闭
16033=自动隐藏
16034=向左滚动
16035=向右滚动
16036=全部自动隐藏
16103=自定义
16104=<无标题>
16105=关闭
16106=默认菜单
16107=默认应用程序菜单。 在没有打开的文档时出现。
16108=-------------------------------------------------------------------------------------------
16109=是否确实要删除工具栏“%s”?
16110=所有命令
16111=所有更改都将丢失! 是否确实要重置工具栏“%s”?
16112=所有更改都将丢失! 是否确实要重置所有工具栏和菜单?
16113=所有更改都将丢失! 是否确实要重置菜单“%s”?
16114=默认
16115=所有更改都将丢失! 是否确实要重置键盘分配?
16243=无法创建 %d 个以上的用户定义工具栏!
16244=这将删除在此应用程序中所用命令的记录，并将一组默认的可见命令还原到菜单和工具栏。 它不会撤消任何显式自定义。 是否确实要执行此操作?
16300=重置工具栏(&R)
16901=填充工具|填充
16902=铅笔工具|铅笔
16903=选择颜色工具|选择颜色
16904=线条工具|线条
16905=矩形工具|矩形
16906=椭圆工具|椭圆
16907=复制工具|复制
16908=粘贴工具|粘贴
16909=清除工具|清除
17017=工具栏选项
17018=添加或删除按钮(&A)
17019=任务窗格
17020=后退
17021=前进
17022=主页
17023=关闭
17024=其他任务窗格
17025=关闭全屏显示
17026=全屏显示
17027=在一行内显示按钮(&H)
17028=分两行显示按钮(&H)
17029=显示更多按钮
17030=显示更少按钮
17031=导航窗格选项...
17038=窗口位置
17039=浮动(&F)
17040=停靠(&D)
17041=自动隐藏(&A)
17042=隐藏(&H)
17043=活动文件
17081=在功能区下方显示快速访问工具栏
17082=在功能区上方显示快速访问工具栏
17083=添加到快速访问工具栏
17084=从快速访问工具栏删除
17085=自定义快速访问工具栏...
17086=最小化功能区
17087=状态栏配置
17088=选项卡式文档(&T)
17091=打印预览(&P)
17092=打印
17093=缩放
17094=预览
17095=<分隔符>
17096=自定义快速访问工具栏
17097=更多命令...
17098=在功能区下方显示
17099=在功能区上方显示
17101=取消
17102=撤消 %d 项操作
17103=撤消 1 项操作
17107=更多
17108=第 %d 行(共 %d 行)
17109=第 %d-%d 行(共 %d 行)
31514=切变
32975=位图
33071=红光预览处理过程|红光预览
33077=设置校正参数
33078=设置激光器参数
33081=调节M值
33082=调节M值
33087=分区域快速排序|快速排序
33130=注销当前用户
33170=语言切换
33175=English
33176=简体中文
33177=繁体中文
33187=铺助对象|捕获存在对象端点
33214=设置运动打标参数|设置运动打标参数
33244=绘制螺旋线|螺旋线工具
33251=初始化打标机，使之进入多卡打标状态|多卡打标
33254=3D校正
33258=初始化打标机，使之进入飞行打标状态|飞行打标
33260=端口参数设置
33277=|选取对象
33289=|删除所选对象
33290=|X镜像
33291=|Y镜像
57612=通过电子邮件发送活动文档|发送邮件
57638=插入剪贴板内容以及指向其源的链接|粘贴链接
57639=有选择地插入剪贴板内容|选择性粘贴
57696=为当前的选定内容选择字体|字体
57856=插入新的嵌入对象|新建对象
57857=编辑链接对象|编辑链接
57858=将选定对象转换为其他类型|转换对象
57859=更改选定对象的图标|更改图标
57872=激活嵌入或链接的对象
57873=激活嵌入或链接的对象
57874=激活嵌入或链接的对象
57875=激活嵌入或链接的对象
57876=激活嵌入或链接的对象
57877=激活嵌入或链接的对象
57878=激活嵌入或链接的对象
57879=激活嵌入或链接的对象
57880=激活嵌入或链接的对象
57881=激活嵌入或链接的对象
57882=激活嵌入或链接的对象
57883=激活嵌入或链接的对象
57884=激活嵌入或链接的对象
57885=激活嵌入或链接的对象
57886=激活嵌入或链接的对象
57887=激活嵌入或链接的对象
58112=关闭打印预览|关闭(&C)
58113=切换单页/双页显示|切换单页/双页显示
58114=下一页|下一页
58115=上一页|上一页
58116=打印文档|打印(&P)
58117=放大|放大
58118=缩小|缩小
59136=扩展名
59137=大写
59138=数字
59139=滚动
59140=改写
59141=记录
59142=假名
59648=转到第一条记录|第一条记录
59649=转到最后一条记录|最后一条记录
59650=转到下一条记录|下一条记录
59651=转到上一条记录|上一条记录
61402=打开选定项
61440=打开
61441=另存为
61442=所有文件(*.*)
61443=无标题
61444=副本另存为
61446=未命名的文件
61457=隐藏(&H)
61577=更新 %1(&U)
61580=退出并回到 %1(&X)
61581=更新 ActiveX 对象
61582=图片(元文件)|一幅图片
61583=设备独立位图|一幅设备独立位图
61584=位图|一幅位图
61585=%s|%s
61586=%s|%s
61588=链接的 %s
61589=未知类型
61590=多信息文本(RTF)|字体和段落格式化的文本
61591=未格式化文本|未经过任何格式化的文本
61592=无效的货币。
61696=文件名不正确。
61697=打开文档失败。
61698=保存文档失败。
61699=是否保存对 %1 的更改?
61700=建立空文档失败。
61701=该文件太大，无法打开。
61702=无法启动打印作业。
61703=启动帮助失败。
61704=内部应用程序出错。
61705=命令失败。
61706=没有足够的内存执行操作。
61707=系统注册项已被移除并且相应的 INI 文件(如存在)也被删除。
61708=不是所有的系统注册项(或 INI 文件)都被移除。
61709=在系统中没有找到该程序所需的文件 %s。
61710=该程序连接到丢失的输出 %s (在文件 %s 中)。该计算机上安装的可能是不兼容的 %s 版本。
61712=请输入一个整数。
61713=请输入一个数字。
61714=请输入一个在 %1 和 %2 之间的整数。
61715=请输入一个在 %1 和 %2 之间的数字。
61716=请输入不多于 %1 个的字符。
61717=请选择一个按钮。
61718=请输入一个在 0 和 255 之间的整数。
61719=请输入一个正整数。
61720=请输入一个日期和/或时间值。
61721=请输入一种货币。
61722=请输入一个 GUID。
61723=请输入一个时间。
61724=请输入一个日期。
61728=意外的文件格式。
61729=%1|无法找到该文件。|请验证指定的路径和文件名是否正确。
61730=目标磁盘驱动器已满。
61731=无法对 %1 进行读操作，它已经被其他人打开。
61732=无法对 %1 进行写操作，因为它是只读文件或已经被其他人打开。
61733=在对 %1 进行读操作时发生错误。
61734=在对 %1 进行写操作时发生错误。
61744=%1: %2|是否继续运行脚本?
61745=调度异常: %1
61824=无法激活静止的 AciveX 对象。
61825=连接失败。|链接可能已经断了。
61826=无法处理命令，服务器程序正忙。
61827=执行服务器程序操作失败。
61828=文档对象服务器不支持这个文件。
61829=%1|无法注册文档。|该文档可能已经打开。
61830=启动服务器应用程序失败。
61831=在继续运行前对 %1 进行更新?
61832=在 OLE 容器中存储嵌入式对象失败
61833=注册失败。ActiveX 功能可能无法正确运行。
61834=更新系统注册记录失败。|请尝试用 REGEDIT。
61835=转换 ActiveX 对象失败。
61836=无法读取只写属性。
61837=无法写入只读属性。
61838=当正在退出 Windows 时，无法保存 ActiveX 对象！|放弃对 %1 所做的所有的修改吗？
61839=创建对象失败。请确认应用程序已在系统注册表中注册。
61840=无法加载邮件系统支持。
61841=邮件系统 DLL 无效。
61842=“发送邮件”未能发送邮件。
61856=未发生错误。
61857=访问 %1 时发生未知错误。
61858=没有找到 %1。
61859=%1 包含错误的路径。
61860=无法打开 %1，因为打开的文件太多。
61861=对 %1 的访问被拒绝。
61862=与 %1 相关联的文件句柄不正确。
61863=无法删除 %1，因为它是当前目录。
61864=该目录已满，无法创建 %1。
61865=对 %1 进行查找失败。
61866=访问 %1 时遇到硬件 I/O 错误。
61867=访问 %1 时遇到共享冲突。
61868=访问 %1 时遇到锁定冲突。
61869=访问 %1 时磁盘已满。
61870=试图访问 %1 时超过它的结尾。
61872=未发生错误。
61873=访问 %1 时发生未知错误。
61874=试图在对 %1 进行读操作的同时对其进行写操作。
61875=试图访问 %1 时超过它的结尾。
61876=试图在对 %1 进行写操作的同时对其进行读操作。
61877=%1 格式错误。
61878=%1 包含意外的对象。
61879=%1 包含错误的架构。
61888=像素
62081=连接到数据源失败。
62082=记录集仅支持向前移动。
62083=打开表失败 - 未指定要检索的列。
62084=查询返回意外的列数据类型。
62085=更新或删除失败。
62086=已更新多行。
62087=操作失败，无当前记录。
62088=更新或删除操作未影响任何数据行。
62089=记录集是只读的
62090=ODBC 驱动程序不支持 MFC LongBinary 数据模型。
62091=加载所需的 ODBC32.DLL 部件失败。
62092=ODBC 驱动程序不支持动态集。
62093=要支持快照功能，需要使用 ODBC 静态游标。
62094=ODBC 驱动程序与 MFC 数据库类不兼容(API_CONFORMANCE >=SQL_OAC_LEVEL1 必须成立)。
62095=ODBC 驱动程序与 MFC 数据库类不兼容(SQL_CONFORMANCE >=SQL_OSC_MINIMUM 必须成立)。
62096=试图超出数据的开头结尾。
62097=ODBC 驱动程序不支持动态集。
62098=需要符合 ODBC 的二级标准的驱动程序。
62099=ODBC 驱动程序不支持定位更新。
62100=不支持所要求的锁模式。
62101=数据被截断。
62102=检索记录出错。
62103=未找到所需的 ODBC 进入点。请确保 ODBC 安装正确。
62104=更新或删除操作失败。
62105=ODBC驱动程序不支持动态指针。
62106=字段名或字段索引不正确。
62107=书签不被 ODBC 驱动程序支持。
62108=书签在记录集中未激活。
62109=<已删除>
62128=无法对DAO/Jet db引擎进行初始化。
62129=错误的DFX值参数。
62130=DAO TableDef或QueryDef没有打开。
62131=GetRows 失败。分配给行的内存不足。
62132=GetRows 绑定错误。可能是数据类型不匹配造成的。
62133=GetRows 失败。所请求的列不属于该记录集。
62177=取消选中
62178=选中
62179=混合
65025=(未知)
65028=桌面
65029=应用程序工作区
65030=窗口背景
65031=窗口文本
65032=菜单栏
65033=菜单文字
65034=活动的标题栏
65035=非活动标题栏
65036=活动的标题栏文字
65037=非活动标题栏文字
65038=活动边框
65039=非活动边框
65040=窗口框架
65041=滚动条
65042=按钮表面
65043=按钮阴影
65044=按钮文本
65045=按钮突出
65046=禁用的文本
65047=突出
65048=突出显示的文本
65049=常规
65050=加粗
65051=倾斜
65052=加粗倾斜
65053=AaBbYyZz
65054=(字体)
65055=(颜色)
65056=(图片 - %s)
65057=所有图片类型|*.bmp;*.cur;*.dib;*.emf;*.ico;*.wmf|Bitmaps (*.bmp;*.dib)|*.bmp;*.dib|Icons/Cursors (*.ico;*.cur)|*.ico;*.cur|Metafiles (*.wmf;*.emf)|*.wmf;*.emf|所有文件(*.*)|*.*||
65058=未知
65059=无
65060=位图
65061=元文件
65062=图标
65064=颜色属性页
65065=颜色
65066=字体属性页
65067=字体
65068=图片属性页
65069=图片
65072=浏览图片
65073=0 - 无
65074=1 - 固定单个
65088=编辑(&E)
65089=属性(&P)...
65155=无法打开图片文件 %1。此文件可能不存在或不可读。
65156=无法装入图片文件 %1。该文件的格式可能不正确。
65157=无法装入图片文件 %1。该文件太大内存无法容纳。
65158=无法装入图片文件 %1。未予具体说明的读操作失败。
65184=非法函数调用
65185=溢出
65186=内存不足
65187=除数为零
65188=字符串空间不足
65189=堆栈空间不足
65190=文件名或文件号错误
65191=文件未找到
65192=文件模式错误
65193=文件已经打开
65194=设备发生 I/O 错误
65195=文件已经存在
65196=记录长度错误
65197=磁盘已满
65198=记录号码错误
65199=文件名错误
65200=文件太多
65201=设备不可用
65202=权限被拒绝
65203=磁盘未准备好
65204=路径/文件访问错误
65205=未找到路径
65206=模式字符串不正确
65207=null 使用不当
65208=文件格式不正确
65209=属性值不正确
65210=数组索引不正确
65211=无法在运行时刻设置属性
65212=该属性为只读
65213=使用属性数组时必须指定数组索引
65214=无法对此控件设置属性
65215=无法在运行时读取属性
65216=该属性为只写
65217=没有找到属性
65218=无效的剪贴板格式
65219=无效图片
65220=打印机出错
65221=无法创建用于进行保存的临时文件
65222=没有找到要查找的文本
65223=要替换的文本太长
282=运动参数设置
224=动态运动打标设置
225=旋转打标设置
226=红光(F1)
227=停止红光(F1)
221= 笔号
222= 颜色

[IDD_DIALOG_LANGUAGESET]
CAPTION=语言设置
1=确定
2=取消
2157=
2158=语言选择：
2139=下次重启才生效，是否立即重启？

;HWDRAWCFG 打标参数模块
[HWDRVCFG]
PAGE0=通用
PAGE1=高级
PAGE2=特殊
CNT=打标次数
ASV=打标速度(mm/s)
ESV=空跳速度(mm/s)
QSF=Q频(KHz)
QRT=Q释放(us)
LDT=层延时(us)
MQR=打标质量系数
ODL=激光开延时(us)
FDL=激光关延时(us)
MLT=走笔延时(us)
JDL=跳转延时(us)
MDL=拐弯延时(us)
WAT=电流(%)
FPT=首脉冲抑制时间(us)
FIP=首点比例
FAP=抑制长度系数
FMP=峰值能量
FCR=首脉冲电流系数
CUR=电流(%)
POW=功率(%)
SMC=维持电流(%)
WAF=波形
PLS=激光模式
SMP=维持功率(%)
PLW=激光脉宽(ns)

[IDD_DIALOG_MOTIONSET]
CAPTION=运动参数设置
679=退出
2156=保存
2153=

[IDD_DIALOG_TEXT_LOG_SET]
CAPTION=日志设定
1=确定
2=取消
2149=浏览
2150=
2208=文件路径
2151=加工时输出文本到指定文件
2152=加工时输出时间到指定文件
2153=检查文本是否被标刻过
2154=浏览
2155=浏览

[PLUSE_DIVISION]
PulseNum=脉冲个数
DivideRate=分频倍数

[IDD_SELECT_POS]
CAPTION=选择坐标的基准
1=确定
2=取消
1031=
1032=
1033=
1034=
1035=
1036=
1037=
1038=
1039=


[IDD_CARD_RUNTIP]
CAPTION=控制卡运行信息
1984=DA卡1功能与版本信息
1979=DA Card 1 No information!
1980=DA卡2功能与版本信息
1981=
1982=LASER卡功能与版本信息
1835=报警
2157=正常
2158=Y:报警关激光使能
2159=N:报警关激光未使能

[IDD_DIALOG_KEYBINDSET]
CAPTION=快捷键绑定
1=保存
2=关闭
2168=
1266=编辑
1186=删除
2176=

[IDD_DIALOG_RESETKEYBIND]
CAPTION=快捷键命令修改
1=确定
2=取消
2170=按键：
2173=清除
683=
2177=(例:CTRL + ATL + Q)
2178=命令：

[IDD_DIALOG_FILTERPOINTSET]
CAPTION=滤点设置
1=滤点
2=退出
2158=滤点精度:
2159=滤点角度:
2116=mm
2104=°

[IDD_DIALOG_CURVEMERGE]
CAPTION=相邻曲线合并设置
1=相邻曲线合并
2=退出
2157=曲线合并最大距离

[IDD_DIALOG_CHANGESKIN]
CAPTION=皮肤设置
1=更换
2=退出
2163=
2164=
2162=皮肤风格
2165=标题
2166=皮肤预览
